{
  "id": "abaddon",
  "name": "Abaddon",
  "portrait": {
    "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/abaddon_full.png?v=5027641?v=5027641",
    "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/abaddon_vert.jpg?v=5027641"
  },
  "attack": "โจมตีระยะใกล้",
  "roles": "ตัวซัพพอร์ต - ตัวแคร์รี - ตัวยืน",
  "primary_attribs": "str",
  "overview": {
    "attribs": {
      "int": "21 + 2",
      "agi": "23 + 1.5",
      "str": "23 + 3",
      "dmg": "32 - 42",
      "ms": 325,
      "armor": 1.22
    },
    "abilities": [
      {
        "id": "abaddon_death_coil",
        "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_death_coil_hp1.png?v=5027641",
        "name": "Mist Coil",
        "desc": "Abaddon ปลดปล่อยกลุ่มหมอกแห่งความตาย ซึ่งสร้างความเสียหายแก่ยูนิตศัตรูหรือรักษายูนิตฝ่ายเดียวกัน แลกกับพลังชีวิตบางส่วนของ Abaddon"
      },
      {
        "id": "abaddon_aphotic_shield",
        "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_aphotic_shield_hp1.png?v=5027641",
        "name": "Aphotic Shield",
        "desc": "อัญเชิญพลังแห่งความมืดมาวนเวียนอยู่รอบยูนิตเพื่อนร่วมทีม สร้างโล่ป้องกันที่ดูดซับความเสียหายจำนวนหนึ่ง โล่จะระเบิดและสร้างความเสียหายบริเวณโดยรอบเมื่อถูกทำลาย เท่ากับความเสียหายที่มันสามารถดูดซับเอาไว้ได้ ชำระล้างบัฟด้านลบและอาการสตันบางชนิดให้กับยูนิตที่ถูกร่ายใส่     ชนิดการลบล้าง: การลบล้างขั้นสูง"
      },
      {
        "id": "abaddon_frostmourne",
        "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_frostmourne_hp1.png?v=5027641",
        "name": "Curse of Avernus",
        "desc": "Abaddon จู่โจมศัตรู ลดความเร็วในการเคลื่อนที่ของเป้าหมาย หากเป้าหมายถูกโจมตีครบ 4 ครั้ง จะทำให้เป้าหมายติดคำสาปเย็นยะเยือก ส่งผลให้ถูกใบ้และเคลื่อนที่ช้าลง และการโจมตีต่อเป้าหมายทั้งหมดนั้นได้รับความเร็วในการโจมตีเพิ่มขึ้น"
      },
      {
        "id": "abaddon_borrowed_time",
        "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_borrowed_time_hp1.png?v=5027641",
        "name": "Borrowed Time",
        "desc": "เมื่อเปิดใช้งาน ความเสียหายที่คุณได้รับทั้งหมดจะกลายเป็น การฟื้นฟูพลังชีวิตแทนที่จะทำอันตราย บัฟด้านลบเกือบทั้งหมด จะถูกขจัดออก สกิลนี้จะเปิดใช้งานโดยอัตโนมัติ หากไม่ได้อยู่ใน ระหว่างคูลดาวน์และพลังชีวิตของคุณลดลงเหลือต่ำกว่า 400 หน่วย    อัปเกรดได้ด้วย Aghanim's Scepter     ชนิดการลบล้าง: การลบล้างขั้นสูง"
      }
    ]
  },
  "bio": "Font หรือ บ่อไอน้ำศักดิ์สิทธิ์แห่ง Avernus เป็นต้นกำเนิดของความแข็งแกร่งของตระกูล Avernus บ่อไอน้ำที่เกิดจากจากรอยแยกของชั้นหินดั้งเดิมที่ปล่อยไอระเหยพวยพุ่ง ซึ่งเป็นสิ่งที่ใช้ทำนายอนาคตของเด็กทารกที่เกิดขึ้นมาและชะตากรรมของตระกูลมาแล้วหลายชั่วรุ่น ทารกที่เกิดในบ้านของ Avernus แต่ละคนจะถูกชำระล้างด้วยหมอกทมิฬ การชำระล้างนี้ทำให้พวกเขาสามารถเชื่อมต่อกับพลังพิศวงของแผ่นดิน พวกเขาแต่ละคนจะเติบโตขึ้นบนแนวคิดของการปกป้องวงศ์ตระกูลและสืบทอดเชื้อสาย แต่ความเป็นจริงแล้วสิ่งที่พวกเขาปกป้องอยู่ก็คือบ่อน้ำศักดิ์สิทธิ์ Font ซึ่งแรงจูงใจของหมอกทมิฬนี้ก็ยังคงคลุมเคลือ เมื่อทารก Abaddon ได้ถือกำเนิด และถูกชำระล้างที่น้ำศักดิ์สิทธิ์ของ Font ผู้คนที่นั่นเริ่มพูดถึงสิ่งที่ผิดปกติ นั่นคือเด็กคนนี้มีสายตาที่เปี่ยมไปด้วยแสงประกายแห่งความรู้แจ้ง จนเหล่านักบุญทางศาสนาเริ่มกระซิบบอกเล่าต่อกัน ทำให้ Abaddon ถูกเลี้ยงดูโดยได้รับความคาดหวังจากทุกคนของตระกูล Avernus ที่ต้องเดินตามสายทางของทายาทตระกูล -- พวกเขาตั้งใจจะฝึกอบรม Abandon เพื่อการสงคราม และในยามที่จำเป็นสามารถเป็นผู้นำกองทัพของตระกูล และพร้อมปกป้องดินแดนของบรรพบุรุษ แต่ Abandon กลับไม่เป็นดั่งที่ทุกคนคาดหวัง ในขณะที่คนอื่นได้ฝึกฝนการใช้อาวุธ แต่ Abaddon กลับฝึกฝนสมาธิท่ามกลางหมอกทมิฬที่ปกคลุมตัว เขาดื่มเอาไอระเหยที่ไหลออกมาจากบ่อน้ำพุศักดิสิทธิ เขาฝึกฝนการผสมผสานจิตวิญญาณของเขาเข้ากับพลังจากหมอกทมิฬ ในที่สุดเขาก็กลายเป็นสิ่งมีชีวิตที่มีปกคลุมไปด้วยหมอกทมิฬ การกระทำของเขาส่งผลให้เกิดความไม่พอใจอย่างมากในตระกูล Avernus -- ผู้เฒ่าและพลทหารในกองทัพล้วนกล่าวหาว่า Abaddon ละเลยความรับผิดชอบในการปฏิบัติหน้าที่ แต่ข้อกล่าวหาทั้งหมดถูกยุติลงทันที เมื่อ Abaddon ควบม้าเข้าสู่สนามรบ เขาแสดงให้ประจักษ์ถึงพลังอำนาจของหมอกทมิฬ ทำให้ Abadon อยู่เหนือชีวิต และความตาย เหนือกว่าจอมพลทั้งหมดที่เคยมีมาในตระกูล Avernus",
  "stats": {
    "hit_points": [
      587,
      1385,
      2335
    ],
    "mana": [
      273,
      637,
      1157
    ],
    "damage": [
      55,
      97,
      147
    ],
    "armor": [
      1,
      4,
      9
    ],
    "sight_range": [
      1800,
      800
    ],
    "attack_range": 150,
    "missile_speed": "900"
  },
  "abilities": [
    {
      "id": "abaddon_death_coil",
      "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_death_coil_hp2.png?v=5027641",
      "name": "Mist Coil",
      "desc": "Abaddon ปลดปล่อยกลุ่มหมอกแห่งความตาย ซึ่งสร้างความเสียหายแก่ยูนิตศัตรูหรือรักษายูนิตฝ่ายเดียวกัน แลกกับพลังชีวิตบางส่วนของ Abaddon",
      "mana_cost": "50",
      "cooldown": "450",
      "video": "http:\/\/www.youtube.com\/embed\/stcWsFoEfag?hd=1&rel=0",
      "lore": "ไอระเหยอันน่าพิศวงจากบ่อน้ำพุแห่ง Font of Avernus ได้หลอมรวมเป็นลมหายใจของ Abaddon ผู้ที่ปลดปล่อยมันได้ตามใจหวัง",
      "affects": [
        {
          "name": "ประเภทสกิล",
          "val": "ยูนิตเป้าหมาย"
        },
        {
          "name": "ส่งผลต่อ",
          "val": "ฮีโร่"
        },
        {
          "name": "ประเภทความเสียหาย",
          "val": "เวทมนตร์"
        },
        {
          "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
          "val": "ได้"
        }
      ],
      "damage": []
    },
    {
      "id": "abaddon_aphotic_shield",
      "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_aphotic_shield_hp2.png?v=5027641",
      "name": "Aphotic Shield",
      "desc": "อัญเชิญพลังแห่งความมืดมาวนเวียนอยู่รอบยูนิตเพื่อนร่วมทีม สร้างโล่ป้องกันที่ดูดซับความเสียหายจำนวนหนึ่ง โล่จะระเบิดและสร้างความเสียหายบริเวณโดยรอบเมื่อถูกทำลาย เท่ากับความเสียหายที่มันสามารถดูดซับเอาไว้ได้ ชำระล้างบัฟด้านลบและอาการสตันบางชนิดให้กับยูนิตที่ถูกร่ายใส่     ชนิดการลบล้าง: การลบล้างขั้นสูง",
      "mana_cost": "100\/105\/110\/115",
      "cooldown": "12\/10\/8\/6",
      "video": "http:\/\/www.youtube.com\/embed\/AUZPOPV0FiU?hd=1&rel=0",
      "lore": "พลังแห่งหมอกทมิฬ ปรากฎขึ้นเพื่อดูดซับการโจมตี ดั่งเช่นหมอกสีดำที่ดูดกลืนแสงได้",
      "affects": [
        {
          "name": "ประเภทสกิล",
          "val": "ยูนิตเป้าหมาย"
        },
        {
          "name": "ส่งผลต่อ",
          "val": "ยูนิตฝ่ายเดียวกัน"
        },
        {
          "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
          "val": "ไม่ได้"
        }
      ],
      "damage": [
        {
          "name": "ระยะเวลา",
          "val": "15"
        },
        {
          "name": "รัศมีการระเบิด",
          "val": "675"
        }
      ]
    },
    {
      "id": "abaddon_frostmourne",
      "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_frostmourne_hp2.png?v=5027641",
      "name": "Curse of Avernus",
      "desc": "Abaddon จู่โจมศัตรู ลดความเร็วในการเคลื่อนที่ของเป้าหมาย หากเป้าหมายถูกโจมตีครบ 4 ครั้ง จะทำให้เป้าหมายติดคำสาปเย็นยะเยือก ส่งผลให้ถูกใบ้และเคลื่อนที่ช้าลง และการโจมตีต่อเป้าหมายทั้งหมดนั้นได้รับความเร็วในการโจมตีเพิ่มขึ้น",
      "mana_cost": "",
      "cooldown": "",
      "video": "http:\/\/www.youtube.com\/embed\/83iU74QhxWw?hd=1&rel=0",
      "lore": null,
      "affects": [
        {
          "name": "ประเภทสกิล",
          "val": "ติดตัว"
        },
        {
          "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
          "val": "ไม่ได้"
        }
      ],
      "damage": [
        {
          "name": "ระยะเวลาพื้นฐาน",
          "val": "4"
        },
        {
          "name": "ช้าลงพื้นฐาน",
          "val": "10% \/ 15% \/ 20% \/ 25%"
        },
        {
          "name": "ระยะเวลา CURSE",
          "val": "4.5"
        },
        {
          "name": "ช้าลงจาก CURSE",
          "val": "30% \/ 40% \/ 50% \/ 60%"
        }
      ]
    },
    {
      "id": "abaddon_borrowed_time",
      "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/abaddon_borrowed_time_hp2.png?v=5027641",
      "name": "Borrowed Time",
      "desc": "เมื่อเปิดใช้งาน ความเสียหายที่คุณได้รับทั้งหมดจะกลายเป็น การฟื้นฟูพลังชีวิตแทนที่จะทำอันตราย บัฟด้านลบเกือบทั้งหมด จะถูกขจัดออก สกิลนี้จะเปิดใช้งานโดยอัตโนมัติ หากไม่ได้อยู่ใน ระหว่างคูลดาวน์และพลังชีวิตของคุณลดลงเหลือต่ำกว่า 400 หน่วย    อัปเกรดได้ด้วย Aghanim's Scepter     ชนิดการลบล้าง: การลบล้างขั้นสูง",
      "mana_cost": "0\/0\/0",
      "cooldown": "60\/50\/40",
      "video": "http:\/\/www.youtube.com\/embed\/9J7CPbAg9dU?hd=1&rel=0",
      "lore": "ที่สุดของความสามารถเหนือธรรมชาติของ Avernus พลังนี้ทำลายความเข้าใจของทุกชีวิต สิ่งที่ควรจะเจ็บกลับถูกรักษา และสิ่งที่ควรจะฆ่ากลับมอบพลังให้",
      "affects": [
        {
          "name": "ประเภทสกิล",
          "val": "ไม่มีเป้าหมาย"
        }
      ],
      "damage": [
        {
          "name": "พลังชีวิตที่จะเปิดใช้งาน",
          "val": "400"
        },
        {
          "name": "ระยะเวลา",
          "val": "4 \/ 5 \/ 6"
        },
        {
          "name": "ระยะเวลาโดย SCEPTER",
          "val": "5 \/ 6 \/ 7"
        },
        {
          "name": "เปลี่ยนเส้นทางความเสียหายโดย SCEPTER",
          "val": "50%"
        },
        {
          "name": "ระยะที่เปลี่ยนเส้นทางโดย SCEPTER",
          "val": "1200"
        }
      ]
    }
  ]
}
