{
    "id": "alchemist",
    "name": "Alchemist",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/alchemist_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/alchemist_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะใกล้",
    "roles": [
        "ตัวแคร์รี",
        "ตัวซัพพอร์ต",
        "ตัวยืน",
        "ตัวหยุด",
        "ตัวเปิด",
        "ตัวนูค"
    ],
    "primary_attribs": "str",
    "overview": {
        "attribs": {
            "int": {
                "base": 25,
                "gain": 1.8
            },
            "agi": {
                "base": 22,
                "gain": 1.2
            },
            "str": {
                "base": 25,
                "gain": 2.4
            },
            "dmg": {
                "min": 24,
                "max": 33
            },
            "ms": 305,
            "armor": 2.08
        },
        "abilities": [
            {
                "id": "alchemist_acid_spray",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_acid_spray_hp1.png?v=5027641",
                "name": "Acid Spray",
                "desc": "พ่นน้ำกรดความดันสูงเข้าสู่พื้นที่เป้าหมาย ยูนิตศัตรูใดๆ ก็ตามที่เข้าสู่พื้นที่ปนเปี้อนนี้จะได้รับความเสียหายเป็นวินาทีและถูกลดเกราะป้องกันลง"
            },
            {
                "id": "alchemist_unstable_concoction",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_unstable_concoction_hp1.png?v=5027641",
                "name": "Unstable Concoction",
                "desc": "Alchemist ผสมน้ำยาที่มีส่วนประกอบไม่แน่นอน ซึ่งเขาสามารถโยนไปยังฮีโร่ฝ่ายศัตรูเพื่อสตันและสร้าง ความเสียหายรอบพื้นที่ที่ระเบิด ยิ่งใช้เวลาผสมนานเท่าไร ความเสียหายและระยะเวลาการสตันก็จะเพิ่มมากขึ้นเท่านั้น หลังจาก 5 วินาที น้ำยาจะมีความสามารถในการสร้าง ความเสียหายและการสตันสูงสุด แต่หากไม่โยนภายใน 5.5 วินาที น้ำยาจะระเบิดและส่งผลทั้งหมดแก่ Alchemist เอง!"
            },
            {
                "id": "alchemist_goblins_greed",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_goblins_greed_hp1.png?v=5027641",
                "name": "Greevil's Greed",
                "desc": "Alchemist สังเคราะห์โกลด์เพิ่มจากศัตรูและรูน Bounty โดยในแต่ละการสังหาร Alchemist จะได้รับเงินโบนัสขั้นต่ำ รวมกับเงินโบนัสเพิ่มเติม หาก Alchemist สังหารยูนิตถัดไป แล้วได้รับเงินภายในช่วง 40 วินาที เงินโบนัสเพิ่มเติมจะ ถูกเพิ่มเข้าไปในเงินโบนัสทั้งหมดอีกหนึ่งชุด ทำให้เงินโบนัส รวมทั้งหมดเพิ่มมากขึ้น นอกจากนี้ รูน Bounty จะให้เงิน แก่เขามากขึ้น"
            },
            {
                "id": "alchemist_chemical_rage",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_chemical_rage_hp1.png?v=5027641",
                "name": "Chemical Rage",
                "desc": "Alchemist ให้ยาอันทำให้คลุ้มคลั่งแก่ Orge ของเขา ลดคูลดาวน์การโจมตีพื้นฐาน เพิ่มความเร็วในการเคลื่อนที่ และเพิ่มอัตราฟื้นฟูพลังชีวิตและมานา    ชนิดการลบล้าง: การลบล้างพื้นฐาน"
            }
        ]
    },
    "bio": "ศาสตร์อันศักดิ์สิทธิ์แห่งการเล่นแร่แปรธาตุเป็นสิ่งที่สืบทอดกันมาหลายชั่วตระกูล Darkbrew แต่ไม่มี Darkbrew คนใดแสดงความสร้างสรรค์ ความทะเยอทะยาน และความกล้าบ้าบิ่นแต่วัยเยาว์เช่นเดียวกับ Razzil น้อย อย่างไรก็ตาม เมื่อเติบโตขึ้นเขาได้ทิ้งการค้าขายของครอบครัวไปทดลองสร้างทองคำผ่านทางการเล่นแร่แปรธาตุ ในการเสี่ยงที่จะสร้างชื่อเสียงให้กับตัวเขาเอง Razzil ประกาศว่าเขาจะเปลี่ยนภูเขาทั้งลูกให้กลายเป็นทอง ยี่สิบปีหลังจากค้นคว้า ใช้จ่าย และเตรียมการ เขาล้มเหลวโดยสิ้นเชิง ต่อมาเขาถูกขังเนื่องจากการทดลองของเขาก่อให้เกิดการทำลายล้างเป็นวงกว้าง แต่กระนั้น Razzil ไม่ใช่คนที่จะท้อถอยง่าย ๆ และได้พยายามหาทางหลบหนี เมื่อเพื่อนร่วมห้องขังคือยักษ์ผู้ดุดัน เขาพบโอกาสที่เขาต้องการ หลังจากชักจูงยักษ์ตนนั้นไม่ให้กินเขาได้ Razzil บรรจงผสมยาให้มันดื่ม ยาที่ทำจากเห็ดราที่หาได้จากห้องทำงานในคุก ภายในสัปดาห์เดียวโอกาสก็มาถึง เมื่อยักษ์ตนนั้นดื่มยาเข้าไป ยักษ์นั้นบ้าคลั่งอย่างที่ไม่มีใครหยุดได้ ทำลายลูกกรงและระเบิดกำแพงออกไปเช่นเดียวกับผู้คุม ต่อมาพวกเขายืนอยู่กลางป่าท่ามกลางซากเมืองที่พังพินาศโดยไม่มีใครไล่ตามมา ผลข้างเคียงของยาทำให้ยักษ์ดูสงบ มีความสุข กระทั่งอดทนรอคำสั่งได้ พวกเขาตกลงว่าจะทำงานร่วมกัน ทั้งคู่ออกเดินทางเพื่อค้นหาวัตถุดิบของ Razzil สำหรับความพยายามที่จะแปรธาตุอีกครั้ง",
    "stats": {
        "hit_points": [
            625,
            1263,
            2099
        ],
        "mana": [
            325,
            653,
            1147
        ],
        "damage": [
            49,
            83,
            127
        ],
        "armor": [
            2,
            4,
            9
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 150,
        "missile_speed": "900"
    },
    "abilities": [
        {
            "id": "alchemist_acid_spray",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_acid_spray_hp2.png?v=5027641",
            "name": "Acid Spray",
            "desc": "พ่นน้ำกรดความดันสูงเข้าสู่พื้นที่เป้าหมาย ยูนิตศัตรูใดๆ ก็ตามที่เข้าสู่พื้นที่ปนเปี้อนนี้จะได้รับความเสียหายเป็นวินาทีและถูกลดเกราะป้องกันลง",
            "mana_cost": "130\/140\/150\/160",
            "cooldown": "22",
            "video": "http:\/\/www.youtube.com\/embed\/MUE1KNbho4Q?hd=1&rel=0",
            "lore": "Razzil ผสมสารที่เป็นกรดซึ่งสามารถละลายได้แม้แต่โลหะที่มีความแข็งแกร่งที่สุดโดยใช้การเล่นแร่แปรธาตุอันเก่าแก่ที่สืบทอดมาจากครอบครัว Darkbrew",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "กายภาพ"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมี",
                    "val": "475 \/ 525 \/ 575 \/ 625"
                },
                {
                    "name": "ระยะเวลา",
                    "val": "16"
                },
                {
                    "name": "ความเสียหายต่อวินาที",
                    "val": "15 \/ 20 \/ 25 \/ 30"
                }
            ]
        },
        {
            "id": "alchemist_unstable_concoction",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_unstable_concoction_hp2.png?v=5027641",
            "name": "Unstable Concoction",
            "desc": "Alchemist ผสมน้ำยาที่มีส่วนประกอบไม่แน่นอน ซึ่งเขาสามารถโยนไปยังฮีโร่ฝ่ายศัตรูเพื่อสตันและสร้าง ความเสียหายรอบพื้นที่ที่ระเบิด ยิ่งใช้เวลาผสมนานเท่าไร ความเสียหายและระยะเวลาการสตันก็จะเพิ่มมากขึ้นเท่านั้น หลังจาก 5 วินาที น้ำยาจะมีความสามารถในการสร้าง ความเสียหายและการสตันสูงสุด แต่หากไม่โยนภายใน 5.5 วินาที น้ำยาจะระเบิดและส่งผลทั้งหมดแก่ Alchemist เอง!",
            "mana_cost": "120",
            "cooldown": "22\/20\/18\/16",
            "video": "http:\/\/www.youtube.com\/embed\/12jG2U6LH6s?hd=1&rel=0",
            "lore": "จากความผิดพลาดในการพยายามเปลี่ยนภูเขาให้เป็นทองกลับกลายเป็นดี เมื่อสารละลายที่ได้มานั้นมีประสิทธิภาพในการทำลายได้อย่างดีเยี่ยม",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "กายภาพ"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "สตันนานสุด",
                    "val": "1.75 \/ 2.5 \/ 3.25 \/ 4"
                },
                {
                    "name": "รัศมีการระเบิด",
                    "val": "200"
                }
            ]
        },
        {
            "id": "alchemist_goblins_greed",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_goblins_greed_hp2.png?v=5027641",
            "name": "Greevil's Greed",
            "desc": "Alchemist สังเคราะห์โกลด์เพิ่มจากศัตรูและรูน Bounty โดยในแต่ละการสังหาร Alchemist จะได้รับเงินโบนัสขั้นต่ำ รวมกับเงินโบนัสเพิ่มเติม หาก Alchemist สังหารยูนิตถัดไป แล้วได้รับเงินภายในช่วง 40 วินาที เงินโบนัสเพิ่มเติมจะ ถูกเพิ่มเข้าไปในเงินโบนัสทั้งหมดอีกหนึ่งชุด ทำให้เงินโบนัส รวมทั้งหมดเพิ่มมากขึ้น นอกจากนี้ รูน Bounty จะให้เงิน แก่เขามากขึ้น",
            "mana_cost": "",
            "cooldown": "",
            "video": "http:\/\/www.youtube.com\/embed\/uHDQHquQk6E?hd=1&rel=0",
            "lore": "ถึงมันจะไม่ใช่ภูเขา แต่ Razzil ก็ยังชำนาญในด้านการแปรสภาพสิ่งที่เล็กกว่านั้นให้เป็นทองเพื่อเติมเต็มกระเป๋าตังค์ของเขา",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ติดตัว"
                }
            ],
            "damage": [
                {
                    "name": "ช่วงเวลาสังหารต่อเนื่อง",
                    "val": "40"
                },
                {
                    "name": "เงินโบนัสขั้นต่ำ",
                    "val": "4"
                },
                {
                    "name": "เงินโบนัสเพิ่มเติม",
                    "val": "4"
                },
                {
                    "name": "เงินโบนัสสูงสุดต่อการสังหาร",
                    "val": "20 \/ 24 \/ 28 \/ 32"
                },
                {
                    "name": "คูณเงินรูน BOUNTY",
                    "val": "2 \/ 2.5 \/ 3 \/ 3.5"
                }
            ]
        },
        {
            "id": "alchemist_chemical_rage",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/alchemist_chemical_rage_hp2.png?v=5027641",
            "name": "Chemical Rage",
            "desc": "Alchemist ให้ยาอันทำให้คลุ้มคลั่งแก่ Orge ของเขา ลดคูลดาวน์การโจมตีพื้นฐาน เพิ่มความเร็วในการเคลื่อนที่ และเพิ่มอัตราฟื้นฟูพลังชีวิตและมานา    ชนิดการลบล้าง: การลบล้างพื้นฐาน",
            "mana_cost": "50\/100\/150",
            "cooldown": "55",
            "video": "http:\/\/www.youtube.com\/embed\/7SrgzbFp9Rw?hd=1&rel=0",
            "lore": "เหล้าที่ Razzil เคยให้ Ogre ดื่มตอนที่พวกเขาแหกคุกได้กลายเป็นยาที่มีประโยชน์ท่ามกลางสงคราม",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลา",
                    "val": "25"
                },
                {
                    "name": "เพิ่มอัตราฟื้นฟูมานา",
                    "val": "4 \/ 10 \/ 16"
                },
                {
                    "name": "เพิ่มความเร็วในการเคลื่อนที่",
                    "val": "40 \/ 50 \/ 60"
                }
            ]
        }
    ]
}
