{
    "id": "arc_warden",
    "name": "Arc Warden",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/arc_warden_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/arc_warden_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะไกล",
    "role": [
        "ตัวแคร์รี",
        "ตัวหนี",
        "ตัวนูค"
    ],
    "primary_attribs": "agi",
    "overview": {
        "attribs": {
            "int": {
                "base": 24,
                "gain": 2.6
            },
            "agi": {
                "base": 15,
                "gain": 2.4
            },
            "str": {
                "base": 25,
                "gain": 3
            },
            "dmg": {
                "min": 31,
                "max": 41
            },
            "ms": 280,
            "armor": 0.1
        },
        "abilities": [
            {
                "id": "arc_warden_flux",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_flux_hp1.png?v=5027641",
                "name": "Flux",
                "desc": "ฉีดยูนิตศัตรูตัวเดียวด้วยพลังงานผันผวนและระเหย ลดความเร็ว ในการเคลื่อนที่และสร้างความเสียหายต่อเนื่องกับเป้าหมาย ผลของสกิลจะไม่ทำงานหากมียูนิตศัตรูตัวอื่นอยู่ใกล้กับเป้าหมาย"
            },
            {
                "id": "arc_warden_magnetic_field",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_magnetic_field_hp1.png?v=5027641",
                "name": "Magnetic Field",
                "desc": "สร้างสนามพลังงานแม่เหล็กวงกลมที่จะป้องกันและเพิ่มความเร็ว ในการโจมตีให้แก่ฮีโร่และสิ่งก่อสร้างฝ่ายเดียวกันที่อยู่ในพื้นที่ โดยทำให้หลบหลีกการโจมตีทุกอย่างจากภายนอกสนามพลังงานได้"
            },
            {
                "id": "arc_warden_spark_wraith",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_spark_wraith_hp1.png?v=5027641",
                "name": "Spark Wraith",
                "desc": "อัญเชิญ Spark Wraith ที่ค่อย ๆ สร้างตัวขึ้นมา และอยู่เฝ้า พื้นที่เป้าหมายจนกว่าศัตรูจะเข้ามาในระยะ เมื่อพบเป้าหมาย Wraith จะหลอมร่างเข้ากับพวกเขา โดยสร้างความเสียหาย เวทมนตร์และทำให้ยูนิตช้าลง"
            },
            {
                "id": "arc_warden_tempest_double",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_tempest_double_hp1.png?v=5027641",
                "name": "Tempest Double",
                "desc": "แตกองค์ประกอบเป็นอีกร่างในเวลาสั้น ๆ Arc Warden สร้าง ร่างเงาไฟฟ้าสมบูรณ์แบบของเขา ร่างเงาสามารถใช้ไอเท็มและ สกิลในปัจจุบันของ Arc Warden ได้ ยกเว้นของบริโภคและ ไอเท็มที่ตกเมื่อตาย ร่างเงามีคูลดาวน์ของไอเท็มหรือสกิลแยก กันกับร่างจริง"
            }
        ]
    },
    "bio": "ก่อนเริ่มต้นของทั้งกาลนั้นมีจิตดวงหนึ่งมีชีวิตอยู่ เป็นจิตใจเริ่มแรกที่ขอบเขตไม่มีที่สิ้นสุด มีความน่ากลัว และมีจุดมุ่งหมายที่ไม่อาจหยั่งรู้ได้ เมื่อจักรวาลปรากฏตัวขึ้น จิตใจดวงนี้ก็ได้แตกและกระจายออก ชิ้นส่วนใหญ่สองชิ้นจากชิ้นส่วนหลักทั้งหลาย ได้รับการเรียกขานว่า Radiant และ Dire ค้นพบตัวตนว่าทั้งสองส่วนต่างติดอยู่ในฝั่งตรงข้ามกันอย่างสิ้นเชิง และเริ่มบิดเบือนสิ่งที่สร้างขึ้นมาทั้งหมดเพื่อตอบสนองความขัดแย้งกันของทั้งสองฝ่าย\r\n\r\n \r\n\r\nในขณะที่สงครามและภัยพิบัติได้ก่อตัวขึ้นมาไม่นานและเป็นภัยคุกคามต่อจักรวาล ความมุ่งมั่นของชิ้นส่วนหลักที่สามได้ประกาศตัวตนออกมา ตั้งชื่อตนเองว่า Zet สติปัญญาตนนี้พยายามที่จะแก้ปัญหาความแตกแยกและทำให้ชิ้นส่วนทั้งหมดกลับมาเป็นหนึ่งเดียวอย่างสมบูรณ์แบบ ด้วยความกลัวในนิสัยความขัดแย้งของผู้ร่วมสืบสาย Zet จึงได้รวบรวมพลังทั้งหมดของตน ในช่วงเวลาฉับพลัน เขาก็ได้ครอบงำพี่น้องของเขา หลอมชิ้นส่วนที่มีความคิดขัดแย้งรวมเป็นดวงดาราทรงกลม และปล่อยพุ่งออกไปสู่ความมืดมิดไปโคจรรอบโลกดวงหนึ่ง ความเป็นหนึ่งเดียวกันจึงได้กลับมาอีกครั้ง แต่ความแข็งแกร่งของ Zet นั้นเหลือเพียงแค่เสี้ยวเดียว Zet จ้องมองไปยังดวงดาราเรือนจำดังกล่าว และเลือกที่จะบั่นทอนพลังของตนเพื่อเป็นผู้คุมเฝ้าจนกว่าจะสิ้นสุดของกาล แม้เวลาจะผ่านไปชั่วกัปชั่วกัลป์ ผู้คุมตนนี้ก็ยังคงเฝ้าอยู่ตลอด\r\n\r\n \r\n\r\nชีวิตในโลกข้างใต้ได้เติบโตขึ้นโดยไม่สนถึงภัยอันตรายที่ถูกพันธนาการไว้ในดวงจันทร์และไม่สนใจถึงความพยายามของ Zet ที่จะควบคุมมัน ในขณะที่เชลยที่ถูกขังไว้ในเรือนจำต่อสู้ภายในกันอย่างไม่มีที่สิ้นสุด พื้นผิวของดวงดาราเริ่มสั่นสะเทือนและแตกออก ในท้ายที่สุด พลังของ Zet ที่เหลือน้อยนิดก็ไม่เพียงพอที่จะควบคุมการจองจำให้คงอยู่ได้อีกต่อไป และสุดท้ายดวงจันทร์จึงได้ถูกทำลาย นักโทษที่อยู่มาอย่างยาวนานได้หลบหนีออกมา และเริ่มรากฐานความขัดแย้งใหม่อีกครั้ง\r\n\r\n \r\n\r\nZet ถูกดีดตัวไปห่างไกลสุดขอบจากการระเบิดของเรือนจำ เขาถูกเปลี่ยนร่างโดยพลังงานความขัดแย้งของนักโทษในอดีต ความคิดและตัวตนหนึ่งเดียวของตัวเขาถูกฉีกออก ตัวตนของเขาถูกแบ่งเป็นชิ้นส่วนเล็กและใหญ่ แต่ละส่วนเชื่อมโยงกันด้วยริ้วแห่งความคิด เขาพยายามดิ้นรนเพื่อหยุดยั้งความแตกแยกของตัวเอง Zet มุ่งไปยัง​​ความขัดแย้งที่กำลังขยายตัวของผู้ร่วมสืบสาย และเบือนความรู้สึกนึกคิดให้ออกมาเป็นข้อสรุปเดียว: จิตใจเริ่มแรกทั้งหมดจะต้องถูกรวบรวมตัวกลับมาเป็นหนึ่งเดียว หรือจะต้องถูกทำลายทั้งหมดเพื่อไม่ให้ความขัดแย้งเติบใหญ่ไปมากกว่านี้...",
    "stats": {
        "hit_points": [
            625,
            1423,
            2373
        ],
        "mana": [
            312,
            785,
            1383
        ],
        "damage": [
            46,
            80,
            124
        ],
        "armor": [
            0,
            5,
            11
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 625,
        "missile_speed": "900"
    },
    "abilities": [
        {
            "id": "arc_warden_flux",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_flux_hp2.png?v=5027641",
            "name": "Flux",
            "desc": "ฉีดยูนิตศัตรูตัวเดียวด้วยพลังงานผันผวนและระเหย ลดความเร็ว ในการเคลื่อนที่และสร้างความเสียหายต่อเนื่องกับเป้าหมาย ผลของสกิลจะไม่ทำงานหากมียูนิตศัตรูตัวอื่นอยู่ใกล้กับเป้าหมาย",
            "mana_cost": "75",
            "cooldown": "16",
            "lore": "ชิ้นส่วนเล็ก ๆ ของพลังงานที่ถูกจองจำไว้ใน Ancient",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ความเสียหายต่อวินาที",
                    "val": "15 \/ 30 \/ 45 \/ 60"
                },
                {
                    "name": "รัศมีค้นหาเพื่อนร่วมทีม",
                    "val": "225"
                },
                {
                    "name": "เคลื่อนที่ช้าลง",
                    "val": "20% \/ 30% \/ 40% \/ 50%"
                },
                {
                    "name": "ระยะร่าย",
                    "val": "500 \/ 600 \/ 700 \/ 800"
                }
            ]
        },
        {
            "id": "arc_warden_magnetic_field",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_magnetic_field_hp2.png?v=5027641",
            "name": "Magnetic Field",
            "desc": "สร้างสนามพลังงานแม่เหล็กวงกลมที่จะป้องกันและเพิ่มความเร็ว ในการโจมตีให้แก่ฮีโร่และสิ่งก่อสร้างฝ่ายเดียวกันที่อยู่ในพื้นที่ โดยทำให้หลบหลีกการโจมตีทุกอย่างจากภายนอกสนามพลังงานได้",
            "mana_cost": "50\/70\/90\/110",
            "cooldown": "20",
            "lore": "กาลและอวกาศเป็นเพียงเรื่องเล็กน้อยสำหรับผู้มีอายุอย่าง Zet",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมี",
                    "val": "300"
                },
                {
                    "name": "ระยะเวลา",
                    "val": "3.5 \/ 4.5 \/ 5.5 \/ 6.5"
                },
                {
                    "name": "เพิ่มความเร็วในการโจมตี",
                    "val": "50 \/ 60 \/ 70 \/ 80"
                },
                {
                    "name": "เพิ่มอัตราหลบหลีก",
                    "val": "100%"
                }
            ]
        },
        {
            "id": "arc_warden_spark_wraith",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_spark_wraith_hp2.png?v=5027641",
            "name": "Spark Wraith",
            "desc": "อัญเชิญ Spark Wraith ที่ค่อย ๆ สร้างตัวขึ้นมา และอยู่เฝ้า พื้นที่เป้าหมายจนกว่าศัตรูจะเข้ามาในระยะ เมื่อพบเป้าหมาย Wraith จะหลอมร่างเข้ากับพวกเขา โดยสร้างความเสียหาย เวทมนตร์และทำให้ยูนิตช้าลง",
            "mana_cost": "80",
            "cooldown": "4",
            "lore": "ชิ้นส่วนเล็กน้อยของร่างต้นแบบของ Zet",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมีค้นหาศัตรู",
                    "val": "375"
                },
                {
                    "name": "ดีเลย์การเริ่มทำงาน",
                    "val": "2"
                },
                {
                    "name": "ระยะเวลา",
                    "val": "50"
                },
                {
                    "name": "ความเร็วของ WRAITH",
                    "val": "400"
                },
                {
                    "name": "ระยะเวลาช้าลง",
                    "val": "0.4 \/ 0.5 \/ 0.6 \/ 0.7"
                }
            ]
        },
        {
            "id": "arc_warden_tempest_double",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/arc_warden_tempest_double_hp2.png?v=5027641",
            "name": "Tempest Double",
            "desc": "แตกองค์ประกอบเป็นอีกร่างในเวลาสั้น ๆ Arc Warden สร้าง ร่างเงาไฟฟ้าสมบูรณ์แบบของเขา ร่างเงาสามารถใช้ไอเท็มและ สกิลในปัจจุบันของ Arc Warden ได้ ยกเว้นของบริโภคและ ไอเท็มที่ตกเมื่อตาย ร่างเงามีคูลดาวน์ของไอเท็มหรือสกิลแยก กันกับร่างจริง",
            "mana_cost": "",
            "cooldown": "60\/50\/40",
            "lore": "บิดเบือนด้วยพลังงานรอบตัวของเขา Arc Warden กลายเป็นสิ่งที่เขาเกลียดมากที่สุด: การแตกตัว",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลา",
                    "val": "16 \/ 20 \/ 24"
                }
            ]
        }
    ]
}