{
    "id": "elder_titan",
    "name": "Elder Titan",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/elder_titan_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/elder_titan_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะใกล้",
    "role": [
        "ตัวเปิด",
        "ตัวหยุด",
        "ตัวนูค",
        "ตัวยืน"
    ],
    "primary_attribs": "str",
    "overview": {
        "attribs": {
            "int": {
                "base": 23,
                "gain": 1.6
            },
            "agi": {
                "base": 14,
                "gain": 1.8
            },
            "str": {
                "base": 24,
                "gain": 3
            },
            "dmg": {
                "min": 23,
                "max": 33
            },
            "ms": 310,
            "armor": 1.96
        },
        "abilities": [
            {
                "id": "elder_titan_echo_stomp",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_echo_stomp_hp1.png?v=5027641",
                "name": "Echo Stomp",
                "desc": "ทั้ง Elder Titan และ Astral Spirit ของเขากระทืบลงที่พื้น ทำความเสียหายและกระแทกยูนิตศัตรูที่อยู่รอบพื้นที่ให้หมดสติ การกระทืบของ Elder Titan ทำความเสียหายทางกายภาพ ในขณะที่การกระทืบของร่างวิญญาณทำความเสียหายทางเวทมนตร์"
            },
            {
                "id": "elder_titan_ancestral_spirit",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_ancestral_spirit_hp1.png?v=5027641",
                "name": "Astral Spirit",
                "desc": "Elder Titan ส่ง Astral Spirit ตรงไปด้านหน้า ซึ่งจะสร้าง ความเสียหายแก่ยูนิตทุกตัวที่ทะลุผ่าน เมื่อวิญญาณกลับสู่ร่าง ของ Titan เขาจะได้โบนัสพลังโจมตีและความเร็วในการ เคลื่อนที่ตามจำนวนยูนิตที่วิญญาณได้ผ่าน    Astral Spirit สามารถใช้ความสามารถ Echo Stomp, Return Spirit และ Natural Order"
            },
            {
                "id": "elder_titan_natural_order",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_natural_order_hp1.png?v=5027641",
                "name": "Natural Order",
                "desc": "ลดองค์ประกอบต่าง ๆ ของศัตรูให้เหลือแค่ระดับพื้นฐาน โดยลบ เกราะป้องกันพื้นฐานและความต้านทานความเสียหายเวทมนตร์ ของยูนิตศัตรูใกล้เคียง การลดเกราะป้องกันจะมาจากตรงกลาง รอบฮีโร่ของคุณ ขณะที่การลดความต้านทานเวทมนตร์จะมา จากตรงกลางรอบ Astral Spirit ของคุณ"
            },
            {
                "id": "elder_titan_earth_splitter",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_earth_splitter_hp1.png?v=5027641",
                "name": "Earth Splitter",
                "desc": "สร้างรอยแยกแผ่ออกไปยังเบื้องหน้าของ Elder Titan หลังจากนั้น 3 วินาที รอยแยกจะเกิดการระเบิด ทำให้เคลื่อนที่ ช้าลงและทำความเสียหายตามค่าพลังชีวิตสูงสุดของยูนิตนั้น ความเสียหายครึ่งหนึ่งเป็นความเสียหายทางเวทมนตร์ ส่วนอีก ครึ่งหนึ่งเป็นความเสียหายทางกายภาพ    อัปเกรดได้ด้วย Aghanim's Scepter"
            }
        ]
    },
    "bio": "บางทีคุณอาจจะเคยสงสัยว่า \"โลกนี้เกิดขึ้นมาได้อย่างไร?\" ทำไมในบรรดาโลกที่ถูกสร้างขึ้นนั้น มีเพียงที่นี่เท่านั้นที่แตกต่าง มันเต็มไปด้วยสัตว์นานาพันธุ์ที่แสนหลากหลาย มีวัฒนธรรมและเรื่องเล่าอยู่มากมาย? จากหนึ่งในเรื่องเล่ามากมายได้กล่าวไว้ว่า \"คำตอบนั้น.. อยู่ที่พวกไททัน\" \r\n\r\nหากไม่นับผู้ที่ได้ชื่อว่าเป็นผู้สร้างตัวจริงแล้ว พวกเขาก็เปรียบดั่งต้นกำเนิดของสรรพชีวิตทั้งมวลที่อยู่ใกล้กับจุดเริ่มต้นของทุกสิ่งที่สุด แม้ไม่ได้ประจักษ์ผ่านช่วงกำเนิดเริ่มต้นด้วยตนเอง พวกเขาก็เกิดมาพร้อมกับเสียงที่ยังคงดังก้องอยู่ในหู พร้อมด้วยพลังงานแรกเริ่มของทั้งจักรวาลติดมากับตัว พวกเขาไม่เคยปราถนาสิ่งใด นอกจากสานต่อการสร้างสิ่งต่าง ๆ ต่อไปในฐานะผู้สร้าง ด้วยเหตุนี้ พวกเขาจึงเริ่มงานขึ้นรูปของสิ่งต่าง ๆ ตามความตั้งใจของพวกเขา พวกเขาเริ่มลงค้อน ให้ความร้อน ดัดขึ้นรูป หรือแม้แต่ระเบิดมัน และเมื่อใดที่พวกเขาพึงพอใจกับทุกสิ่งที่สร้างขึ้นมาแล้วนั้น พวกเขาก็เริ่มหันเครื่องมือมาที่ตัวพวกเขาเอง และเริ่มการปรับเปลี่ยนจิตใจและสร้างวิญญาณของพวกเขาขึ้นมาใหม่ไปเรื่อย ๆ จนกว่าพวกเขาจะกลายเป็นสิ่งที่ยิ่งใหญ่เหนือสิ่งอื่นใด ซึ่งความเป็นจริงนี้ มันก็กลายเป็นผลงานที่ดีที่สุดของพวกเขา แต่ทว่าตลอดระยะเวลาที่ผ่านมา มีบางครั้งที่พวกเขาเองก็ทำพลาด เพราะว่าอุดมการณ์อันยิ่งใหญ่นั้น ความผิดพลาดเองก็เป็นสิ่งที่หลีกเลี่ยงไม่ได้เช่นกัน \r\n\r\nผู้ที่เรารู้จักกันในนาม Elder Titan นั้นเคยเป็นนักบุกเบิกผู้ยิ่งใหญ่ ผู้เรียนรู้ในศาสตร์ของการสร้าง เพื่อที่จะฝึกฝนทักษะของเขา เขาทำการแยกส่วนบางสิ่งที่ไม่อาจซ่อมแซมได้อีก ทำได้เพียงโยนมันทิ้งเท่านั้น เขาได้ตกลงสู่โลกที่พังทลายของเขา ด้วยวิญญาณที่แยกส่วนออกมาด้วยตัวเขาเอง ที่นั่นเขาได้ใช้ชีวิตอยู่ท่ามกลางเศษหินที่ขรุขระ และแผ่นดินที่มีแต่รอยแยก พร้อมกับเหล่าชิ้นส่วนอื่น ๆ ที่สูญหายไปตามรอยแยกในช่วงยุคต้นของจักรวาล และนั่นคือสาเหตุว่าทำไมโลกที่เรารู้จักถึงถูกเรียกว่า หมู่เกาะที่ถูกทิ้งร้าง เหล่าผู้ที่รอดชีวิตนั้นก็ถูกลืมเลือนไปเนิ่นนานแล้ว ถูกลืมโดยตัวเขาเองที่คอยตำหนิตัวเองเรื่อยมา เขาใช้เวลาชั่วนิรันดร์ของเขาในการพยายามหาวิธีซ่อมแซมให้สำเร็จ และนั่นอาจจะนำเขาไปพบกับชิ้นส่วนวิญญาณที่พังทลายของเขา ในที่ที่พวกเราและโลกที่เรารู้จักจะถูกซ่อมแซมได้อีกครั้ง และนี่คือเรื่องราวของผู้ที่เรารู้จักกันในนาม Elder Titan",
    "stats": {
        "hit_points": [
            606,
            1404,
            2354
        ],
        "mana": [
            299,
            590,
            1058
        ],
        "damage": [
            47,
            89,
            139
        ],
        "armor": [
            2,
            5,
            11
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 150,
        "missile_speed": "900"
    },
    "abilities": [
        {
            "id": "elder_titan_echo_stomp",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_echo_stomp_hp2.png?v=5027641",
            "name": "Echo Stomp",
            "desc": "ทั้ง Elder Titan และ Astral Spirit ของเขากระทืบลงที่พื้น ทำความเสียหายและกระแทกยูนิตศัตรูที่อยู่รอบพื้นที่ให้หมดสติ การกระทืบของ Elder Titan ทำความเสียหายทางกายภาพ ในขณะที่การกระทืบของร่างวิญญาณทำความเสียหายทางเวทมนตร์",
            "mana_cost": "100",
            "cooldown": "14\/13\/12\/11",
            "video": "http:\/\/www.youtube.com\/embed\/yBDyBbeVK0k?hd=1&rel=0",
            "lore": "พลังแห่งการสร้างสรรค์ยังคงก้องกังวานอยู่ภายในการกระทืบเท้าของ Titan",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย, ยืนร่าย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "กายภาพ"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "เวลาร่าย",
                    "val": "1.7"
                },
                {
                    "name": "รัศมี",
                    "val": "500"
                },
                {
                    "name": "ระยะเวลาหลับ",
                    "val": "2 \/ 3 \/ 4 \/ 5"
                }
            ]
        },
        {
            "id": "elder_titan_ancestral_spirit",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_ancestral_spirit_hp2.png?v=5027641",
            "name": "Astral Spirit",
            "desc": "Elder Titan ส่ง Astral Spirit ตรงไปด้านหน้า ซึ่งจะสร้าง ความเสียหายแก่ยูนิตทุกตัวที่ทะลุผ่าน เมื่อวิญญาณกลับสู่ร่าง ของ Titan เขาจะได้โบนัสพลังโจมตีและความเร็วในการ เคลื่อนที่ตามจำนวนยูนิตที่วิญญาณได้ผ่าน    Astral Spirit สามารถใช้ความสามารถ Echo Stomp, Return Spirit และ Natural Order",
            "mana_cost": "80\/90\/100\/110",
            "cooldown": "17",
            "video": "http:\/\/www.youtube.com\/embed\/OUUqiie5-Z8?hd=1&rel=0",
            "lore": "เหมือนกับสี่ปฐมพลัง Elder Titan คงอยู่พร้อมกันในทุกภพภูมิและสามารถเรียกอีกตัวตนหนึ่งของตัวเขามาช่วยเหลือเมื่อต้องการ",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมี",
                    "val": "275"
                },
                {
                    "name": "ความเสียหาย",
                    "val": "50"
                },
                {
                    "name": "ระยะเวลา",
                    "val": "8"
                },
                {
                    "name": "ระยะเวลาบัฟ",
                    "val": "10"
                },
                {
                    "name": "โบนัสความเร็ว (ครีป)",
                    "val": "1%"
                },
                {
                    "name": "โบนัสความเร็ว (ฮีโร่)",
                    "val": "7%"
                },
                {
                    "name": "เพิ่มเกราะป้องกัน (ครีป)",
                    "val": "0.5"
                },
                {
                    "name": "เพิ่มเกราะป้องกัน (ฮีโร่)",
                    "val": "1.5 \/ 3 \/ 4.5 \/ 6"
                }
            ]
        },
        {
            "id": "elder_titan_natural_order",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_natural_order_hp2.png?v=5027641",
            "name": "Natural Order",
            "desc": "ลดองค์ประกอบต่าง ๆ ของศัตรูให้เหลือแค่ระดับพื้นฐาน โดยลบ เกราะป้องกันพื้นฐานและความต้านทานความเสียหายเวทมนตร์ ของยูนิตศัตรูใกล้เคียง การลดเกราะป้องกันจะมาจากตรงกลาง รอบฮีโร่ของคุณ ขณะที่การลดความต้านทานเวทมนตร์จะมา จากตรงกลางรอบ Astral Spirit ของคุณ",
            "mana_cost": "",
            "cooldown": "",
            "lore": "ดั่งที่เคยเป็นเมื่อแรกเริ่ม Elder Titan จะทำให้มันเป็นเช่นนั้นอีกครั้ง",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ติดตัว, ออร่า"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมี",
                    "val": "350"
                },
                {
                    "name": "ลดเกราะป้องกันพื้นฐาน",
                    "val": "40% \/ 60% \/ 80% \/ 100%"
                },
                {
                    "name": "ลดความต้านทานพื้นฐาน",
                    "val": "40% \/ 60% \/ 80% \/ 100%"
                }
            ]
        },
        {
            "id": "elder_titan_earth_splitter",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/elder_titan_earth_splitter_hp2.png?v=5027641",
            "name": "Earth Splitter",
            "desc": "สร้างรอยแยกแผ่ออกไปยังเบื้องหน้าของ Elder Titan หลังจากนั้น 3 วินาที รอยแยกจะเกิดการระเบิด ทำให้เคลื่อนที่ ช้าลงและทำความเสียหายตามค่าพลังชีวิตสูงสุดของยูนิตนั้น ความเสียหายครึ่งหนึ่งเป็นความเสียหายทางเวทมนตร์ ส่วนอีก ครึ่งหนึ่งเป็นความเสียหายทางกายภาพ    อัปเกรดได้ด้วย Aghanim's Scepter",
            "mana_cost": "125\/175\/225",
            "cooldown": "100",
            "video": "http:\/\/www.youtube.com\/embed\/OWI9tNGa6dQ?hd=1&rel=0",
            "lore": "สิ่งที่เขาเป็นผู้สร้างขึ้นมานั้น Titan ได้ผ่ามันแยกออกจากกัน",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "ดีเลย์ระเบิด",
                    "val": "3.14"
                },
                {
                    "name": "ความกว้างของรอยแยก",
                    "val": "315"
                },
                {
                    "name": "ระยะทางรอยแยก",
                    "val": "2400"
                },
                {
                    "name": "เคลื่อนที่ช้าลง",
                    "val": "30% \/ 40% \/ 50%"
                },
                {
                    "name": "ระยะเวลาที่ช้าลง",
                    "val": "3 \/ 4 \/ 5"
                },
                {
                    "name": "ความเสียหายต่อพลังชีวิตสูงสุด",
                    "val": "30% \/ 40% \/ 50%"
                },
                {
                    "name": "ระยะเวลาที่ช้าลง\/ปลดอาวุธโดย SCEPTER",
                    "val": "4 \/ 5 \/ 6"
                }
            ]
        }
    ]
}