{
    "id": "grimstroke",
    "name": "Grimstroke",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/grimstroke_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/grimstroke_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะไกล",
    "role": [
        "ตัวซัพพอร์ต",
        "ตัวนูค",
        "ตัวหยุด",
        "ตัวหนี"
    ],
    "primary_attribs": "int",
    "overview": {
        "attribs": {
            "int": {
                "base": 23,
                "gain": 3.8
            },
            "agi": {
                "base": 18,
                "gain": 1.9
            },
            "str": {
                "base": 21,
                "gain": 2.4
            },
            "dmg": {
                "min": 27,
                "max": 31
            },
            "ms": 290,
            "armor": 2.52
        },
        "abilities": [
            {
                "id": "grimstroke_dark_artistry",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_dark_artistry_hp1.png?v=5027641",
                "name": "Stroke of Fate",
                "desc": "Grimstroke ระบายเส้นลายหมึกด้วยพู่กันของเขา สร้างความเสียหายและลดความเร็วศัตรู ความเสียหายจะเพิ่มขึ้นตามยูนิตที่โดนลายหมึกแต่ละตัว"
            },
            {
                "id": "grimstroke_ink_creature",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_ink_creature_hp1.png?v=5027641",
                "name": "Phantom's Embrace",
                "desc": "อัญเชิญปีศาจที่จะพุ่งไปหาเป้าหมายอย่างรวดเร็ว และเกาะเป้าหมายเมื่อไปถึง เมื่อเกาะแล้ว ปีศาจจะสร้างความเสียหายและใบ้ หากปีศาจยังอยู่รอดจนครบระยะเวลาเกาะ เธอจะฉีกร่างเหยื่อของเธอด้วยความเสียหายอันแสนรุนแรง และรีเฟรชคูลดาวน์ของ Phantom's Embrace    การโจมตีของฮีโร่ต่อปีศาจแต่ละครั้งจะนับเป็น 3 ครั้ง"
            },
            {
                "id": "grimstroke_spirit_walk",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_spirit_walk_hp1.png?v=5027641",
                "name": "Ink Swell",
                "desc": "Grimstroke ปกคลุมร่างยูนิตเพื่อนร่วมทีมด้วยน้ำหมึก ทำให้เพิ่มความเร็วในการเคลื่อนที่ของเป้าหมาย ศัตรูที่อยู่ในระยะของยูนิตเพื่อนร่วมทีมจะได้รับความเสียหาย จากเงื้อมมือน้ำหมึกอย่างต่อเนื่อง หลังจากครบ 3 วินาที มันจะระเบิดออก สร้างความเสียหายและสตันในพื้นที่รอบยูนิต เป็นสัดส่วนตามระยะเวลาที่เงื้อมมือน้ำหมึกอยู่ใกล้ฮีโร่"
            },
            {
                "id": "grimstroke_soul_chain",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_soul_chain_hp1.png?v=5027641",
                "name": "Soulbind",
                "desc": "ผูกฮีโร่ศัตรูเป้าหมายเข้ากับฮีโร่ฝ่ายเดียวกันของศัตรูที่อยู่ใกล้ ที่สุดภายในรัศมีผูก ทำให้ทั้งสองไม่สามารถเดินออกจากกันได้ หากฮีโร่ที่โดนผูกตัวใดก็ตามได้รับสกิลที่กำหนดยูนิตเป้าหมาย สกิลดังกล่าวจะถูกร่ายไปหาฮีโร่อีกตัวด้วย หากสายผูกขาดออก ก่อนครบระยะเวลา เป้าหมายแรกจะถูกผูกต่อกับฮีโร่ฝ่ายเดียว กันที่อยู่ใกล้ที่สุดภายในรัศมี"
            }
        ]
    },
    "bio": "The people of Ashkavor crowded around the temple square, eager to witness the ascension of their new guardian -- to stand near the man as he bound their souls to his own. But as his final brush strokes fell against the runestone, and the bond of a new Ascended One was forged, everyone -- even those who'd stayed in their homes -- could sense that something had gone terribly wrong.\r\n\r\nHe knew the cause instantly. The droplets of ichor he'd procured to amplify the potency of his inkpots had instead contaminated them, and the power of the binding spell he'd cast now threatened to consume him. An inky corruption snaked upward from the runestone, along the handle of his brush, soon overtaking his hands. From there it spread quickly. Once it overcame his face and his mouth, he couldn't have screamed even if he'd wanted to.\r\n\r\nAll of his life he'd calculated on how to attain ever greater powers than the limits presented by his teachers would allow--going so far as to break the sacred prohibition against augmenting the inks. Indeed, with the wellspring of the Ascended bond open to him, he felt a measure of power coursing into his soul like he'd never imagined. His greatest triumph was upon him, if he could only survive it.\r\n\r\nHe drew deep from the power of the bond, pushing back against the corrupted ink flow. A great moan filled the air -- the collective cry of his people. Some swayed on their feet. The weakest collapsed. Many tried to run. And still deeper he pulled from their bloodline reservoir. But it wasn't enough to stop the ink tide.\r\n\r\nIt was only when the breath trapped in his lungs began to fail him, and the inkpool darkness fully encased him, that he saw his way out. The bond he'd made with the Ashkavoran people -- his people -- meant to be drawn upon only in service of their protection... It flowed two ways.\r\n\r\nWith a final surge of strength -- this time directed by more than just blind repulsion -- he pushed the ink torrent into the bond itself.\r\n\r\nSlowly, he felt the tide retreat... and heard the awful wails of his people as the corruption in turn rolled over them. When at last the ink relented, his eyes opened upon a world changed. The Ashkavoran people as he knew them were gone. Every last soul was transformed into terrifying shades of their former selves -- comprised no longer of blood and bone, only viscid, tainted ink.",
    "stats": {
        "hit_points": [
            549,
            1187,
            2023
        ],
        "mana": [
            299,
            991,
            1745
        ],
        "damage": [
            50,
            103,
            161
        ],
        "armor": [
            3,
            6,
            12
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 550,
        "missile_speed": "900"
    },
    "abilities": [
        {
            "id": "grimstroke_dark_artistry",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_dark_artistry_hp2.png?v=5027641",
            "name": "Stroke of Fate",
            "desc": "Grimstroke ระบายเส้นลายหมึกด้วยพู่กันของเขา สร้างความเสียหายและลดความเร็วศัตรู ความเสียหายจะเพิ่มขึ้นตามยูนิตที่โดนลายหมึกแต่ละตัว",
            "mana_cost": "100\/110\/120\/130",
            "cooldown": "11\/9\/7\/5",
            "lore": "พลังอสูรจากน้ำหมึกของ Grimstroke ซึ่งถูกดึงมาจากผู้คนของเขาจำนวนมหาศาลที่ล้มตายจะกลืนกินศัตรูใดก็ตามที่อยู่ในเส้นทางของมัน",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "เคลื่อนที่ช้าลง",
                    "val": "50% \/ 60% \/ 70% \/ 80%"
                },
                {
                    "name": "ระยะเวลาช้าลง",
                    "val": "1.5"
                }
            ]
        },
        {
            "id": "grimstroke_ink_creature",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_ink_creature_hp2.png?v=5027641",
            "name": "Phantom's Embrace",
            "desc": "อัญเชิญปีศาจที่จะพุ่งไปหาเป้าหมายอย่างรวดเร็ว และเกาะเป้าหมายเมื่อไปถึง เมื่อเกาะแล้ว ปีศาจจะสร้างความเสียหายและใบ้ หากปีศาจยังอยู่รอดจนครบระยะเวลาเกาะ เธอจะฉีกร่างเหยื่อของเธอด้วยความเสียหายอันแสนรุนแรง และรีเฟรชคูลดาวน์ของ Phantom's Embrace    การโจมตีของฮีโร่ต่อปีศาจแต่ละครั้งจะนับเป็น 3 ครั้ง",
            "mana_cost": "110\/120\/130\/140",
            "cooldown": "32\/28\/24\/20",
            "lore": "Grimstroke ไร้ซึ่งความเศร้าโศกต่อความหายนะของผู้คนของเขา เว้นแต่สำหรับ Yaovhi เธอผู้เป็นคนที่เขารักมากที่สุด ที่เขายังพอมีความรู้สึกที่คล้ายคลึงถึงความโหยหาอยู่บ้าง",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลาเกาะ",
                    "val": "5"
                },
                {
                    "name": "ความเสียหายต่อวินาทีของปีศาจ",
                    "val": "6 \/ 14 \/ 22 \/ 30"
                },
                {
                    "name": "ความเสียหายเมื่อฉึก",
                    "val": "75 \/ 150 \/ 225 \/ 300"
                }
            ]
        },
        {
            "id": "grimstroke_spirit_walk",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_spirit_walk_hp2.png?v=5027641",
            "name": "Ink Swell",
            "desc": "Grimstroke ปกคลุมร่างยูนิตเพื่อนร่วมทีมด้วยน้ำหมึก ทำให้เพิ่มความเร็วในการเคลื่อนที่ของเป้าหมาย ศัตรูที่อยู่ในระยะของยูนิตเพื่อนร่วมทีมจะได้รับความเสียหาย จากเงื้อมมือน้ำหมึกอย่างต่อเนื่อง หลังจากครบ 3 วินาที มันจะระเบิดออก สร้างความเสียหายและสตันในพื้นที่รอบยูนิต เป็นสัดส่วนตามระยะเวลาที่เงื้อมมือน้ำหมึกอยู่ใกล้ฮีโร่",
            "mana_cost": "120\/130\/140\/150",
            "cooldown": "30\/25\/20\/15",
            "lore": "ในเมื่อขณะนี้กระแสน้ำหมึกที่เพิ่มพูนขึ้นไม่ได้เป็นภัยครอบงำ Grimstroke อีกต่อไป พลังเงื้อมมือของมันนั้นก็ไม่ไกลเกินเอื้อมมือของเขา",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายเดียวกัน"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                }
            ],
            "damage": [
                {
                    "name": "ระยะร่าย",
                    "val": "400 \/ 500 \/ 600 \/ 700"
                },
                {
                    "name": "ระยะเวลาบัฟ",
                    "val": "3"
                },
                {
                    "name": "เพิ่มความเร็วในการเคลื่อนที่",
                    "val": "12% \/ 14% \/ 16% \/ 18%"
                },
                {
                    "name": "ความเสียหายสูงสุด",
                    "val": "100 \/ 200 \/ 300 \/ 400"
                },
                {
                    "name": "ระยะเวลาสตันสูงสุด",
                    "val": "1 \/ 1.9 \/ 2.8 \/ 3.7"
                },
                {
                    "name": "ความเสียหายต่อวินาทีของเงื้อมมือน้ำหมึก",
                    "val": "25 \/ 35 \/ 45 \/ 55"
                }
            ]
        },
        {
            "id": "grimstroke_soul_chain",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/grimstroke_soul_chain_hp2.png?v=5027641",
            "name": "Soulbind",
            "desc": "ผูกฮีโร่ศัตรูเป้าหมายเข้ากับฮีโร่ฝ่ายเดียวกันของศัตรูที่อยู่ใกล้ ที่สุดภายในรัศมีผูก ทำให้ทั้งสองไม่สามารถเดินออกจากกันได้ หากฮีโร่ที่โดนผูกตัวใดก็ตามได้รับสกิลที่กำหนดยูนิตเป้าหมาย สกิลดังกล่าวจะถูกร่ายไปหาฮีโร่อีกตัวด้วย หากสายผูกขาดออก ก่อนครบระยะเวลา เป้าหมายแรกจะถูกผูกต่อกับฮีโร่ฝ่ายเดียว กันที่อยู่ใกล้ที่สุดภายในรัศมี",
            "mana_cost": "150\/200\/250",
            "cooldown": "100\/75\/50",
            "lore": "Ascended เป็นบุตรแห่ง Ashkavor ที่ได้รับเลือกขึ้น ซึ่งจะได้รับพลังอำนาจมหาศาลจากการผูกโยงที่สร้างขึ้น ระหว่างวิญญาณของเขากับของเหล่าผู้มีหน้าที่ในการปกป้อง หลังจากผ่านไปหลายปีจากเหตุการณ์หายนะในเชื้อสายของเขา Grimstroke ได้ค้นพบวิธีใช้พิธีกรรมผูกวิญญาณที่สามารถสร้างผลเลวร้ายขึ้นอย่างมาก...",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ฮีโร่ศัตรู"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลา",
                    "val": "6 \/ 7 \/ 8"
                },
                {
                    "name": "รัศมีผูก",
                    "val": "550"
                },
                {
                    "name": "เคลื่อนที่ช้าลง",
                    "val": "10% \/ 20% \/ 30%"
                },
                {
                    "name": "ระยะร่าย",
                    "val": "700 \/ 800 \/ 900"
                }
            ]
        }
    ]
}