{
    "id": "oracle",
    "name": "Oracle",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/oracle_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/oracle_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะไกล",
    "roles": [
        "ตัวซัพพอร์ต",
        "ตัวนูค",
        "ตัวหยุด",
        "ตัวหนี"
    ],
    "primary_attribs": "int",
    "overview": {
        "attribs": {
            "int": {
                "base": 21,
                "gain": 4
            },
            "agi": {
                "base": 15,
                "gain": 1.7
            },
            "str": {
                "base": 20,
                "gain": 2.4
            },
            "dmg": {
                "min": 18,
                "max": 24
            },
            "ms": 300,
            "armor": 2.1
        },
        "abilities": [
            {
                "id": "oracle_fortunes_end",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_fortunes_end_hp1.png?v=5027641",
                "name": "Fortune's End",
                "desc": "สกิลยืนร่าย - รวบรวมพลังของ Oracle ไว้ในสายฟ้าที่มีพลังแห่งการชำระล้าง ซึ่งเมื่อปล่อยออกไปจะสร้างความเสียหาย ทำให้ติดราก และชำระล้างบัฟของศัตรูในพื้นที่รอบ ๆ เป้าหมาย หากเป้าหมายเป็นเพื่อนร่วมทีมจะเป็นการชำระล้างอย่างเดียว สามารถยืนร่ายได้สูงสุดเป็นระยะเวลา 2.5 วินาที โดยระยะเวลาติดรากจะเท่ากับระยะเวลาที่ใช้ในการยืนร่ายสกิล     ชนิดการลบล้าง: การลบล้างพื้นฐาน"
            },
            {
                "id": "oracle_fates_edict",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_fates_edict_hp1.png?v=5027641",
                "name": "Fate's Edict",
                "desc": "Oracle อวยพรคำยินดีแก่เป้าหมาย ทำให้พวกเขาไม่สามารถโจมตีได้และได้รับความต้านทานเวทมนตร์ 100% สามารถร่ายใส่ได้ทั้งเพื่อนร่วมทีมและศัตรู"
            },
            {
                "id": "oracle_purifying_flames",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_purifying_flames_hp1.png?v=5027641",
                "name": "Purifying Flames",
                "desc": "ขจัดสิ่งแปดเปื้อนออกด้วยไฟเผาผลาญ สร้างความเสียหายอย่าง รุนแรงแก่เป้าหมายและส่งผลให้พวกเขาฟื้นฟูพลังชีวิตทุกวินาที อย่างต่อเนื่อง เมื่อสิ้นสุดระยะเวลาแล้วการฟื้นฟูพลังชีวิตจะมี จำนวนมากกว่าความเสียหายในตอนเริ่มต้น สามารถร่ายใส่ได้ทั้งเพื่อนร่วมทีมและศัตรู    อัปเกรดได้ด้วย Aghanim's Scepter"
            },
            {
                "id": "oracle_false_promise",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_false_promise_hp1.png?v=5027641",
                "name": "False Promise",
                "desc": "เปลี่ยนแปลงชะตากรรมของเพื่อนร่วมทีมโดยชั่วคราว ชะลอการ รักษาและความเสียหายที่ได้รับทุกอย่างออกไปจนกระทั่งผลของ False Promise สิ้นสุดลง การรักษาที่ถูกชะลอโดย False Promise จะมีผลเพิ่มขึ้นเป็นสองเท่า ลบล้างสถานะที่ไม่ดีและ การหยุดส่วนใหญ่เมื่อเริ่มต้นการร่าย     ชนิดการลบล้าง: การลบล้างขั้นสูง"
            }
        ]
    },
    "bio": "เหล่าบรรพบุรุษของผู้ครองบัลลังก์แห่ง Cymurri ได้ผูกขาดต้อนรับกลุ่มเทพพยากรณ์จากสำนัก Ivory Incubarium ที่อยู่สูงบนยอดของแอ่งทิวเขา Zealot โดยมัดจำไว้ตั้งแต่ตัวอ่อนเริ่มปฏิสนธิ และจ่ายส่วนที่เหลือให้ครบเมื่อได้รับผู้พยากรณ์ที่ได้รับการฝึกฝนมาเป็นอย่างดี ถึงที่ประตูเมือง Graven \r\n\r\n \r\n\r\nเหล่าเทพพยากรณ์ที่ได้รับเลือกและรับรองซึ่งถูกเลี้ยงดูโดยเหล่านางพยากรณ์สูงสุด Pallid Sybils ผู้ที่ทั้งเลี้ยงดูและให้กำเนิดพวกเขา ต่างถูกยึดติดอยู่ในรูปลักษณ์ทางกายภาพ ดังเช่นเดียวกับร่างกายในโลกของพวกเรา แต่ในขณะที่จิตวิญญาณของพวกเขาคอยท่องไปในแดนไกล เชื่อมผูกติดกับกายด้วยเส้นใยอวกาศอันแสนบางเบา หลังจากท่องไปยังโลกภายนอก พวกเขาก็กลับมาเล่ากล่าวด้วยคำพยากรณ์แห่งลางบอกเหตุเมื่อกลับมายังร่างกายหยาบ คำกล่าวที่น่าเลื่อมใสของพวกเขาถูกวิเคราะห์โดยที่ปรึกษาแห่ง Cymurri ผู้รับสารแห่งนิมิตในอนาคต และเป็นตัวแทนที่ปรึกษาเพื่อไปทูลคำพยากรณ์ให้แก่กษัตริย์แห่ง Graven ทราบเพื่อคว้าชัยชนะในทุกสมรภูมิ ไม่ว่าจะในสภาราชสำนักหรือในสนามรบ และมันเป็นเช่นนี้มาหลายรุ่นแล้ว ในหน้าหนังสือประวัติศาสตร์แห่ง Graven มีชื่อกษัตริย์ผู้กำศึกชัยชนะมากมายมาหลายรุ่นรวมถึงชัยชนะใหม่ ๆ ที่พวกเขาได้รับมา และมันก็ดูจะไปได้ด้วยดี จนกระทั่งนักพยากรณ์นามว่า Nerif ได้ปรากฏตัวขึ้นมารับใช้กษัตริย์ผู้สวมหมวกศิลาองค์ท้ายที่สุดนี้ \r\n\r\n \r\n\r\nแต่แรกเริ่ม คำทำนายของ Nerif นั่นช่างแปลกประหลาด มันดูเหมือนไม่ได้เป็นเพียงแค่การทำนายอนาคต แต่เป็นเหมือนการสร้างอนาคตขึ้นมา ผู้ทำนายอนาคตที่แสนประหลาดพึมพำคำแนะนำออกมาโดยไม่มีใครขอให้ทำ และนั่นทำให้พวกเหล่าขุนนางแห่ง Cymurri ได้รู้สึกถึงภัยความขัดแย้งจากศัตรูคนใหม่ของพวกเขา เหล่าคณะที่ปรึกษาของสภารู้สึกถึงภัยคุกคามต่ออำนาจของพวกเขา และพุ่งเป้าไปยังนักพยากรณ์คนล่าสุดที่ไม่เป็นที่พึงประสงค์ พวกเขาทูลขอการถอดถอน และถวายฎีกาถึงนางพยากรณ์สูงสุด Pallid Sybils ถึงนักพยากรณ์ที่ไร้ประสิทธิภาพและต้องการแทนที่ด้วยที่เหมาะสมกว่านี้คนใหม่ แต่ Nerif ได้อธิบายถึงฝันที่บอกเหตุร้ายถึงความพินาศของสำนัก Incubarium และภายในเวลาไม่ถึงชั่วโมงก็มีสารแจ้งถึงเหตุหิมะถล่มครั้งใหญ่ได้พังทลายสำนักโบราณ ด้วยความหวาดกลัวในการประสบโชคชะตาเช่นเดียวกับเหล่านางพยากรณ์ Pallid Sybils เหล่าที่ปรึกษาได้ถอนตัวจากสภาราชสำนัก และกังวลที่จะหลีกเลี่ยงคำเตือนของ Nerif แต่อย่างไรก็ตาม กษัตริย์แห่ง Graven เป็นผู้ยึดถือประโยชน์ที่ยิ่งใหญ่เป็นหลัก พระองค์เห็นแย้งในประชามติของเหล่าที่ปรึกษาที่ระแวงเกินเหตุ พระองค์ให้เหตุผลถึงความหายากของความสามารถนักพยากรณ์คนนี้ ที่ควรค่าแก่การเป็นดั่งศาสตราวุธที่จะนำพาความยิ่งใหญ่แก่พระองค์ได้ ดังนั้นพระองค์จึงได้ลดขั้นเหล่าขุนนางที่ปรึกษาและแต่งตั้ง Nerif มาคอยอยู่ข้างกายของพระองค์ ด้วยความหารู้ไม่จะเข้าใจถึงความสามารถของ Nerif อย่างแท้จริง พระองค์ทรงสั่งได้ทุกสิ่งที่พระองค์ต้องการ และเกลี้ยกล่อม Nerif ให้คอยกล่าวแต่สิ่งที่พระองค์ประสงค์จากคำทำนาย \r\n\r\n \r\n\r\nในช่วงแรกก็ไปได้ด้วยดี กษัตริย์องค์สุดท้ายแห่ง Graven ได้คุยโวโอ้อวดถึงการรับอุปถัมภ์สัตว์เลี้ยงแห่งโชคชะตาของเขา พระองค์เองยังเล่นกับโชคชะตาของตนเองอีกด้วย แต่พระองค์นั้นก็สมควรรับฟังคำเตือนที่ได้บอกกล่าวมา เมื่อหนึ่งคืนก่อนเกิดการรุกรานจากพวกข้าหลวงที่ไม่พอใจ พระองค์พยายามที่จะบีบบังคับเทพพยากรณ์ของพระองค์ให้ทำนายชัยชนะที่แน่นอนให้ แต่มีเพียงการได้ยินเสียงพึมพัมเงียบ ๆ ของ Nerif ว่า \"มันเป็นไปได้ทั้งสองทาง\" และไม่มีคำแถลงที่หนักแน่นที่พระองค์จะเค้นจากปากของ Nerif ได้มากไปกว่านี้ แต่อย่างไรก็ตามพระองค์ยังคงเชื่อมั่นในกองทหารของตน พวกฝ่ายข้าหลวงต่างถูกปิดล้อม มีอาวุธน้อยนิดไร้ประสิทธิภาพ และยังถูกปิดกั้นจากพันธมิตรต่าง ๆ พระองค์ได้คิดว่าคำกล่าวที่ว่า \"มันเป็นไปได้ทั้งสองทาง\" คือสิ่งที่เป็นพลังในการคว้าชัยของฝ่ายพระองค์ มันคงมีความเสี่ยงเพียงน้อยนิดในแผนของพระองค์ \r\n\r\n \r\n\r\nแน่นอน พวกเราต่างก็ทราบดีว่าพระองค์ควรจะเชื่อคำบอกกล่าวที่ได้รับเตือนมาให้มากกว่านี้ สิ่งที่เกิดขึ้นเบื้องหน้าพระราชวังของข้าหลวงผู้ไม่เคยพอเป็นสิ่งที่ไม่อาจเชื่อสายตาได้ว่าจะเป็นไปได้ มันดูเหมือนว่าภายในใจกลางของการนองเลือด การสู้รบเริ่มจะถูกแบ่งเป็นสองส่วน ทุก ๆ ช่วงเวลาสำคัญ ความเป็นจริงเริ่มที่จะแบ่งแยกและแตกเป็นเสี่ยง เหล่าทหารที่โซเซและล้มตายในสนามรบก็ยังคงยืนหยัดสู้อยู่ด้วยเช่นกัน จิตใจของพวกเขาต่างถูกแบ่งแยก เหล่านักรบพบว่าตนเองทั้งตายและยังไม่ตาย มีตัวตนและไม่มีตัวตน ผลที่เกิดขึ้นทั้งชัยชนะและความพ่ายแพ้ต่างเกิดขึ้นพร้อม ๆ กันกับกองทัพทั้งสองฝ่าย จักรวาลตอนนี้กลายเป็นเหมือนห้องกระจกเงา ที่กระจกทุกบานต่างสะท้อนกันและกันแบบไม่จบสิ้น \r\n\r\n \r\n\r\nผลกระทบที่เกิดขึ้นทันทีกับทั้งสองฝั่งนั้นสุดจะเกินบรรยาย มันยากเกินจะทำความเข้าใจของความรู้สึกที่มีทั้งได้ชัยชนะและพ่ายแพ้ไปพร้อม ๆ กัน สติของกษัตริย์ Graven แตกกระเจิงกลายเป็นผุยผงแห่งความบ้าคลั่ง เหล่าข้าหลวงที่อ่อนต่อโลกเองก็ไม่ต่างกัน ความเป็นจริงที่ตรงข้ามกันยังคงแตกตัวต่อไปเรื่อย ๆ สะท้อนก้องเป็นประวัติศาสตร์มากมายที่ไม่มีวันสิ้นสุด และทั้งหมดนั้นเต็มไปด้วยผู้คนที่สับสนมึนงงมากมายที่ต่างก็สูญเสียความสามารถในการกิน แต่งกาย ป้องกันตัว หรือขยายพันธุ์ตามธรรมชาติปกติได้ \r\n\r\n \r\n\r\nเป็นเวลานานก่อนที่ผลกระทบจะขยายไปมากขึ้น อย่างไรก็ตาม เหล่าที่ปรึกษาที่คอยเฝ้าระวังแห่ง Cymurri ได้จับกุมตัว Nerif ไว้พร้อมพันธนาการและอุดปากเขาไว้ได้ และส่งตัวเขาออกไปจากจักรวาลของพวกเขาด้วยความเร็วสูงบนเรือข้ามมิติ ด้วยความหวังที่จะกำจัดเขาไปให้ไกลเกินที่จะกลับมาทำร้ายพวกเขาได้อีกตลอดไป แน่นอนว่ามันสายเกินไปหน่อยสำหรับพวกเขา และมันก็อาจสายเกินไปสำหรับพวกเราด้วยเช่นกัน",
    "stats": {
        "hit_points": [
            530,
            1168,
            2004
        ],
        "mana": [
            273,
            1001,
            1781
        ],
        "damage": [
            39,
            95,
            155
        ],
        "armor": [
            2,
            5,
            11
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 620,
        "missile_speed": "900"
    },
    "abilities": [
        {
            "id": "oracle_fortunes_end",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_fortunes_end_hp2.png?v=5027641",
            "name": "Fortune's End",
            "desc": "สกิลยืนร่าย - รวบรวมพลังของ Oracle ไว้ในสายฟ้าที่มีพลังแห่งการชำระล้าง ซึ่งเมื่อปล่อยออกไปจะสร้างความเสียหาย ทำให้ติดราก และชำระล้างบัฟของศัตรูในพื้นที่รอบ ๆ เป้าหมาย หากเป้าหมายเป็นเพื่อนร่วมทีมจะเป็นการชำระล้างอย่างเดียว สามารถยืนร่ายได้สูงสุดเป็นระยะเวลา 2.5 วินาที โดยระยะเวลาติดรากจะเท่ากับระยะเวลาที่ใช้ในการยืนร่ายสกิล     ชนิดการลบล้าง: การลบล้างพื้นฐาน",
            "mana_cost": "75",
            "cooldown": "15\/12\/9\/6",
            "video": "http:\/\/www.youtube.com\/embed\/uoC4rmz5pL4?hd=1&rel=0",
            "lore": "ลูกพลังแห่งดวงดาวที่ปะทุด้วยพลังเมื่อพลังงานดิบถูกเปิดออก สามารถขัดขวางการเชื่อมต่อดวงจิตกับร่างกายของศัตรูเป็นเวลาชั่วครู่",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยืนร่าย, ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ฮีโร่"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ความเสียหาย",
                    "val": "120 \/ 150 \/ 180 \/ 210"
                },
                {
                    "name": "ระยะเวลาหยุดต่ำสุด",
                    "val": "0.5"
                },
                {
                    "name": "รัศมี",
                    "val": "300"
                }
            ]
        },
        {
            "id": "oracle_fates_edict",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_fates_edict_hp2.png?v=5027641",
            "name": "Fate's Edict",
            "desc": "Oracle อวยพรคำยินดีแก่เป้าหมาย ทำให้พวกเขาไม่สามารถโจมตีได้และได้รับความต้านทานเวทมนตร์ 100% สามารถร่ายใส่ได้ทั้งเพื่อนร่วมทีมและศัตรู",
            "mana_cost": "50",
            "cooldown": "16\/13\/10\/7",
            "video": "http:\/\/www.youtube.com\/embed\/-5MLuLQ92_w?hd=1&rel=0",
            "lore": "คำทำนายที่ทรงพลานุภาพดังกึกก้อง: พันธมิตรผู้ถูกเลือกจะห่างไกลจากความเจ็บปวดจากเวทมนตร์ใด ๆ หากแต่ความเจ็บปวดจากสิ่งอื่นนั้น...",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลา",
                    "val": "3 \/ 3.5 \/ 4 \/ 4.5"
                },
                {
                    "name": "ระยะ",
                    "val": "500 \/ 600 \/ 700 \/ 800"
                }
            ]
        },
        {
            "id": "oracle_purifying_flames",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_purifying_flames_hp2.png?v=5027641",
            "name": "Purifying Flames",
            "desc": "ขจัดสิ่งแปดเปื้อนออกด้วยไฟเผาผลาญ สร้างความเสียหายอย่าง รุนแรงแก่เป้าหมายและส่งผลให้พวกเขาฟื้นฟูพลังชีวิตทุกวินาที อย่างต่อเนื่อง เมื่อสิ้นสุดระยะเวลาแล้วการฟื้นฟูพลังชีวิตจะมี จำนวนมากกว่าความเสียหายในตอนเริ่มต้น สามารถร่ายใส่ได้ทั้งเพื่อนร่วมทีมและศัตรู    อัปเกรดได้ด้วย Aghanim's Scepter",
            "mana_cost": "80\/85\/90\/95",
            "cooldown": "225",
            "video": "http:\/\/www.youtube.com\/embed\/YP2ZXzx6kX4?hd=1&rel=0",
            "lore": "ดังเช่นห้องโถงแห่งกระจกที่สะท้อนเปลวเพลิงเทียนเพียงเล่มเดียวให้สว่าง กำแพงแห่งจักรวาลที่แตกสลายสามารถเปลี่ยนแปลงแสงแห่งการพยากรณ์ให้กลายเป็นเพลิงเผาผลาญ",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ความเสียหาย",
                    "val": "90 \/ 180 \/ 270 \/ 360"
                },
                {
                    "name": "ฟื้นฟูพลังชีวิตต่อวินาที",
                    "val": "11 \/ 22 \/ 33 \/ 44"
                },
                {
                    "name": "ฟื้นฟูทั้งหมด",
                    "val": "99 \/ 198 \/ 297 \/ 396"
                },
                {
                    "name": "ระยะเวลา",
                    "val": "9"
                },
                {
                    "name": "คูลดาวน์โดย SCEPTER",
                    "val": "1"
                }
            ]
        },
        {
            "id": "oracle_false_promise",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/oracle_false_promise_hp2.png?v=5027641",
            "name": "False Promise",
            "desc": "เปลี่ยนแปลงชะตากรรมของเพื่อนร่วมทีมโดยชั่วคราว ชะลอการ รักษาและความเสียหายที่ได้รับทุกอย่างออกไปจนกระทั่งผลของ False Promise สิ้นสุดลง การรักษาที่ถูกชะลอโดย False Promise จะมีผลเพิ่มขึ้นเป็นสองเท่า ลบล้างสถานะที่ไม่ดีและ การหยุดส่วนใหญ่เมื่อเริ่มต้นการร่าย     ชนิดการลบล้าง: การลบล้างขั้นสูง",
            "mana_cost": "100\/150\/200",
            "cooldown": "115\/80\/45",
            "video": "http:\/\/www.youtube.com\/embed\/q_OHyoGf9Ns?hd=1&rel=0",
            "lore": "ศัตรูและผู้พยากรณ์จอมปลิ้นปล้อนนั้นมักโกหกเกี่ยวกับชะตากรรมของมนุษย์",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ฮีโร่ฝ่ายเดียวกัน"
                }
            ],
            "damage": []
        }
    ]
}
