{
    "id": "phantom_lancer",
    "name": "Phantom Lancer",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/phantom_lancer_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/phantom_lancer_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะใกล้",
    "role": [
        "ตัวแคร์รี",
        "ตัวหนี",
        "ตัวดัน",
        "ตัวนูค"
    ],
    "primary_attribs": "agi",
    "overview": {
        "attribs": {
            "int": {
                "base": 19,
                "gain": 2
            },
            "agi": {
                "base": 29,
                "gain": 3
            },
            "str": {
                "base": 19,
                "gain": 2
            },
            "dmg": {
                "min": 22,
                "max": 44
            },
            "ms": 290,
            "armor": 4.06
        },
        "abilities": [
            {
                "id": "phantom_lancer_spirit_lance",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_spirit_lance_hp1.png?v=5027641",
                "name": "Spirit Lance",
                "desc": "ขว้างหอกวิญญาณวิเศษใส่ยูนิตศัตรูเป้าหมาย สร้างความเสียหายและทำให้เคลื่อนที่ได้ช้าลง พร้อมทั้งสร้างร่างเงาออกมาช่วยโจมตียูนิตนั้น ๆ     อัปเกรดได้ด้วย Aghanim's Scepter"
            },
            {
                "id": "phantom_lancer_doppelwalk",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_doppelwalk_hp1.png?v=5027641",
                "name": "Doppelganger",
                "desc": "Phantom Lancer หายตัวไปจากสนามรบชั่วขณะ หลังจากผ่านไป 1 วินาที Phantom Lancer และร่างเงาที่ อยู่ใกล้เคียงกับเขาจะกลับมาปรากฏตัวในพื้นที่เป้าหมายอีกครั้ง โดยจะสุ่มตำแหน่งพร้อมกับสร้างร่างเสมือนเพิ่มเติมอีกสองตัว เพิ่มระยะเวลาของร่างเงาทั้งหมด ร่างเสมือนเพิ่มเติมทั้งสองจะมีคุณสมบัติที่แตกต่างกันออกไป: ร่างหนึ่งรับความเสียหายปกติและทำความเสียหายไม่ได้ ในขณะที่อีกร่างหนึ่งรับความเสียหาย 600% และทำความเสียหาย 20%     ชนิดการลบล้าง: การลบล้างพื้นฐาน"
            },
            {
                "id": "phantom_lancer_phantom_edge",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_phantom_edge_hp1.png?v=5027641",
                "name": "Phantom Rush",
                "desc": "เมื่อเลือกโจมตีเป้าหมายฝั่งศัตรู Phantom Lancer จะพุ่งเข้าโจมตีจากระยะไกลอย่างรวดเร็ว และได้รับ Agility เพิ่มขึ้นชั่วคราวเมื่อถึงเป้าหมาย ร่างเงาของ Phantom Lancer ก็มีความสามารถนี้เช่นกัน"
            },
            {
                "id": "phantom_lancer_juxtapose",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_juxtapose_hp1.png?v=5027641",
                "name": "Juxtapose",
                "desc": "การโจมตีของ Phantom Lancer มีโอกาสที่จะแยกร่างของเขา โดยการสร้างร่างเงาของตัวเอง ร่างเงาก็มีโอกาสที่จะแยกร่างเช่นกัน ร่างเงาที่ถูกสร้างโดย Phantom Lancer จะมีระยะเวลา 8 วินาที ส่วนร่างเงาที่ถูกสร้างโดยร่างเงาตัวอื่น ๆ จะมีระยะเวลา 4 วินาที"
            }
        ]
    },
    "bio": "หมู่บ้าน Pole อันห่างไกลไม่รับรู้ถึงสงครามที่กำลังระอุอยู่ในใจกลางของอาณาจักร สำหรับพวกเขา ความเงียบสงบของหอกที่แทงปลาและมื้ออาหารของครอบครัว เท่านี้ก็เพียงพอสำหรับความต้องการของชีวิตแล้ว ถึงกระนั้นสงครามก็ลุกลามมาถึง กระนั้นพวกเขาก็รวมตัวกันเป็นกองกำลังและออกเดินทางจากบ้านเกิด มือทวนผู้ถ่อมตน Azwraith สาบานจะนำความสงบสุขกลับมาสู่อาณาจักรของพวกเขา และการจะทำเช่นนั้น เขาและพี่น้องของเขาถูกสั่งให้ตั้งรับการรุกรานครั้งสุดท้ายจากหมอผีผู้น่ากลัว Vorn ความเสียหายของพี่น้องของเขาใหญ่หลวงนัก เมื่อกองกำลังศัตรูรุกเข้าถึงป้อมปราการ มี Azwraith เพียงผู้เดียวที่ยังเหลือรอด และมีเขาเพียงคนเดียวที่หลบรอดแนวป้องกันออกมาได้ ด้วยความโกรธแค้นและมุ่งมั่นจากการล้างสังหารพวกพ้อง Azwraith ฝ่ากับดักถึงตายและผู้คุมที่หมอผีได้เสกเอาไว้ ไม่ช้านักตกปลาสามัญได้มาถึงหอคอยศิลาของหมอผี ทั้งคู่ต่อสู้กันข้ามคืน ทุ่มแทงเข้าใส่กัน และเมื่อการต่อสู้คลายลง Azwraith กรีดร้องอย่างเงียบงันขณะแทงทะลุร่างศัตรูของเขา แต่หมอผีไม่ยอมตายง่ายๆ ร่างของเขาระเบิดออกเป็นประกายแสง ทะลุร่างผู้สังหารเขา เมื่อกลุ่มควันจากการต่อสู้จางลง Azwraith พบว่าตัวเขาอยู่ท่ามกลางพวกพ้องอีกครั้ง แต่ละร่างแต่งกายคล้ายกับตัวเขา แต่ละคนถืออาวุธเช่นเดียวกับเขา และเขาสัมผัสได้ถึงความนึกคิดของแต่ละคน เมื่อรับรู้ว่าพวกพ้องของเขาเดินทางมาถึง เขาเพ่งสมาธิให้ร่างภูติผีเหล่านี้ซ่อนตัว แต่ละตัวก็จางหายไปเหมือนไม่เคยมีสิ่งใดมาก่อน ขณะที่กองทหารเดินทางมาถึงหอคอย พวกเขาพบเพียงนักรบที่เอาชนะหมอผีลงได้ เมื่อพวกเขาเข้ามาหาผู้ชนะ มือทวนได้หายตัวไป มือทวนผู้ยืนตรงหน้าเขากลับกลายเป็นเพียงเงาภูติผีเท่านั้น",
    "stats": {
        "hit_points": [
            511,
            1043,
            1803
        ],
        "mana": [
            247,
            611,
            1131
        ],
        "damage": [
            51,
            93,
            143
        ],
        "armor": [
            4,
            10,
            17
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 150,
        "missile_speed": "900"
    },
    "abilities": [
        {
            "id": "phantom_lancer_spirit_lance",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_spirit_lance_hp2.png?v=5027641",
            "name": "Spirit Lance",
            "desc": "ขว้างหอกวิญญาณวิเศษใส่ยูนิตศัตรูเป้าหมาย สร้างความเสียหายและทำให้เคลื่อนที่ได้ช้าลง พร้อมทั้งสร้างร่างเงาออกมาช่วยโจมตียูนิตนั้น ๆ     อัปเกรดได้ด้วย Aghanim's Scepter",
            "mana_cost": "125\/130\/135\/140",
            "cooldown": "7",
            "video": "http:\/\/www.youtube.com\/embed\/kAQg8iTEvWA?hd=1&rel=0",
            "lore": "ความช่ำชองในการแทงหอกเมื่อถึงปลาคืออาหารจานหลักของครอบครัวของเขาก็พิสูจน์ได้เป็นอย่างดีแล้ว ว่าจะมีประโยชน์ในสนามรบแน่นอน",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลาที่ช้าลง",
                    "val": "3.25"
                },
                {
                    "name": "เคลื่อนที่ช้าลง",
                    "val": "10% \/ 18% \/ 26% \/ 34%"
                },
                {
                    "name": "ระยะเวลาของร่างเงา",
                    "val": "2 \/ 4 \/ 6 \/ 8"
                },
                {
                    "name": "ร่างเงาสร้างความเสียหาย",
                    "val": "20%"
                },
                {
                    "name": "ร่างเงาได้รับความเสียหาย",
                    "val": "400% \/ 400% \/ 400% \/ 400%"
                },
                {
                    "name": "รัศมีการชิ่งโดย SCEPTER",
                    "val": "400"
                },
                {
                    "name": "จำนวนการชิ่งโดย SCEPTER",
                    "val": "5"
                }
            ]
        },
        {
            "id": "phantom_lancer_doppelwalk",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_doppelwalk_hp2.png?v=5027641",
            "name": "Doppelganger",
            "desc": "Phantom Lancer หายตัวไปจากสนามรบชั่วขณะ หลังจากผ่านไป 1 วินาที Phantom Lancer และร่างเงาที่ อยู่ใกล้เคียงกับเขาจะกลับมาปรากฏตัวในพื้นที่เป้าหมายอีกครั้ง โดยจะสุ่มตำแหน่งพร้อมกับสร้างร่างเสมือนเพิ่มเติมอีกสองตัว เพิ่มระยะเวลาของร่างเงาทั้งหมด ร่างเสมือนเพิ่มเติมทั้งสองจะมีคุณสมบัติที่แตกต่างกันออกไป: ร่างหนึ่งรับความเสียหายปกติและทำความเสียหายไม่ได้ ในขณะที่อีกร่างหนึ่งรับความเสียหาย 600% และทำความเสียหาย 20%     ชนิดการลบล้าง: การลบล้างพื้นฐาน",
            "mana_cost": "50",
            "cooldown": "25\/20\/15\/10",
            "video": "http:\/\/www.youtube.com\/embed\/_HLFI68EP-Y?hd=1&rel=0",
            "lore": "การตายของ Dread Magus Vorn ทำให้ Phantom Lancer เปี่ยมไปด้วยความสามารถที่จะดัดหรือหักเหแสง",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                }
            ],
            "damage": [
                {
                    "name": "ขนาดของบริเวณเป้าหมาย",
                    "val": "325"
                },
                {
                    "name": "ระยะของการรวมร่างเงา",
                    "val": "900"
                },
                {
                    "name": "ระยะเวลาก่อนปรากฏตัวอีกครั้ง",
                    "val": "1"
                },
                {
                    "name": "ระยะเวลาของร่างเสมือน",
                    "val": "8"
                },
                {
                    "name": "เพิ่มระยะเวลาร่างเงา",
                    "val": "2"
                }
            ]
        },
        {
            "id": "phantom_lancer_phantom_edge",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_phantom_edge_hp2.png?v=5027641",
            "name": "Phantom Rush",
            "desc": "เมื่อเลือกโจมตีเป้าหมายฝั่งศัตรู Phantom Lancer จะพุ่งเข้าโจมตีจากระยะไกลอย่างรวดเร็ว และได้รับ Agility เพิ่มขึ้นชั่วคราวเมื่อถึงเป้าหมาย ร่างเงาของ Phantom Lancer ก็มีความสามารถนี้เช่นกัน",
            "mana_cost": "",
            "cooldown": "16\/12\/8\/4",
            "video": "http:\/\/www.youtube.com\/embed\/_bfdarOBBU8?hd=1&rel=0",
            "lore": "Azwraith ตระหนักดีว่าบนสนามรบนั้น ความเร็วคือทุกสิ่ง",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย, เปิด\/ปิด"
                }
            ],
            "damage": [
                {
                    "name": "ระยะ RUSH ที่น้อยที่สุด",
                    "val": "250"
                },
                {
                    "name": "เพิ่ม AGILITY",
                    "val": "11 \/ 22 \/ 33 \/ 44"
                }
            ]
        },
        {
            "id": "phantom_lancer_juxtapose",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phantom_lancer_juxtapose_hp2.png?v=5027641",
            "name": "Juxtapose",
            "desc": "การโจมตีของ Phantom Lancer มีโอกาสที่จะแยกร่างของเขา โดยการสร้างร่างเงาของตัวเอง ร่างเงาก็มีโอกาสที่จะแยกร่างเช่นกัน ร่างเงาที่ถูกสร้างโดย Phantom Lancer จะมีระยะเวลา 8 วินาที ส่วนร่างเงาที่ถูกสร้างโดยร่างเงาตัวอื่น ๆ จะมีระยะเวลา 4 วินาที",
            "mana_cost": "",
            "cooldown": "",
            "video": "http:\/\/www.youtube.com\/embed\/rti6D9kGcKY?hd=1&rel=0",
            "lore": "ทุกครั้งที่หอกของ Azwraith แทงออกไปก็ราวกับถูกแทง 2 ครั้งจากนักรบธรรมดาๆ ไม่ก็ 3 ครั้ง หรือ 4...",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ติดตัว"
                }
            ],
            "damage": [
                {
                    "name": "โอกาสในการแยกร่างของฮีโร่",
                    "val": "40% \/ 45% \/ 50%"
                },
                {
                    "name": "โอกาสในการแยกร่างของร่างเงา",
                    "val": "8%"
                },
                {
                    "name": "ร่างเงาสร้างความเสียหาย",
                    "val": "16%"
                },
                {
                    "name": "ร่างเงาได้รับความเสียหาย",
                    "val": "650%"
                }
            ]
        }
    ]
}