{
    "id": "phoenix",
    "name": "Phoenix",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/phoenix_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/phoenix_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะไกล",
    "roles": [
        "ตัวซัพพอร์ต",
        "ตัวนูค",
        "ตัวเปิด",
        "ตัวหนี",
        "ตัวหยุด"
    ],
    "primary_attribs": "str",
    "overview": {
        "attribs": {
            "int": {
                "base": 18,
                "gain": 1.8
            },
            "agi": {
                "base": 12,
                "gain": 1.3
            },
            "str": {
                "base": 19,
                "gain": 3.7
            },
            "dmg": {
                "min": 26,
                "max": 36
            },
            "ms": 280,
            "armor": -0.32
        },
        "abilities": [
            {
                "id": "phoenix_icarus_dive",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_icarus_dive_hp1.png?v=5027641",
                "name": "Icarus Dive",
                "desc": "Phoenix บินโฉบแบบวิถีโค้งไปยังทิศทางเป้าหมาย สร้างความเสียหายต่อเนื่อง และลดความเร็วในการเคลื่อนที่ ของยูนิตที่มันบินเข้าไปหา แล้วจะโคจรกลับไปยังตำแหน่งเดิม ของมัน ถ้า Phoenix ใช้ Supernova การบินจะจบลง"
            },
            {
                "id": "phoenix_fire_spirits",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_fire_spirits_hp1.png?v=5027641",
                "name": "Fire Spirits",
                "desc": "สร้างดวงวิญญาณแห่งไฟ 4 ดวงล้อมรอบ Phoenix เป็นวงกลม วิญญาณไฟแต่ละดวงสามารถปล่อยได้อย่างอิสระต่อกันไปยังพื้นที่ เป้าหมาย ทำให้ยูนิตศัตรูได้รับความเสียหายต่อเนื่องและถูกลด ความเร็วในการโจมตีมหาศาล"
            },
            {
                "id": "phoenix_sun_ray",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_sun_ray_hp1.png?v=5027641",
                "name": "Sun Ray",
                "desc": "Phoenix ยิงลำแสงไฟโดยใช้พลังงานจากพลังชีวิตของมันเอง ลำแสงสร้างความเสียหายแก่ศัตรูและฟื้นฟูพลังชีวิตเพื่อนร่วมทีม โดยคิดจากจำนวนพื้นฐานบวกกับเปอร์เซ็นต์พลังชีวิตของพวกเขา ค่าเปอร์เซ็นต์จะเพิ่มขึ้นเรื่อย ๆ ตามเวลาที่ยิงลำแสงออกไป"
            },
            {
                "id": "phoenix_supernova",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_supernova_hp1.png?v=5027641",
                "name": "Supernova",
                "desc": "Phoenix เต็มใจที่จะจบชีวิตตัวเองเพื่อโอกาสในการเกิดใหม่ แปลงร่างกายเป็นดวงอาทิตย์ที่เผาไหม้ศัตรูในพื้นที่ขนาดใหญ่ ดวงอาทิตย์สามารถถูกทำลายได้โดยการโจมตีจากฮีโร่อีกฝ่าย หลังจากระยะเวลา 6 วินาทีดวงอาทิตย์จะระเบิด และทำการสตันศัตรูทั้งหมดที่อยู่รอบ ๆ การระเบิดยังทำให้ Phoenix เกิดใหม่ด้วยการฟื้นฟูพลังชีวิตและมานาทั้งหมด และทำการยกเลิกคูลดาวน์ของทุกสกิล    อัปเกรดได้ด้วย Aghanim's Scepter     ชนิดการลบล้าง: การลบล้างขั้นสูง"
            }
        ]
    },
    "bio": "ท่ามกลางความมืดอันมิอาจหยั่งถึง ปรากฏประกายแสงตะวันแรกแห่ง Keeper ประจุแสงประหลาดอันมีจิตสำนึกถูกลิขิตมาเพื่อมอบความอบอุ่นให้แก่ผืนพิภพอันว่างเปล่า ข้ามผ่านนิรันดร์กาลที่ยาวนานเหลือคณานับ ดวงไฟอันมองไม่เห็นนี้จะรวบรวมพลังมหาศาลของตน ก่อนจะระเบิดออกเป็นไฟหายนะ Supernova จากไฟที่ร้อนดั่งนรกในครั้งนั้น ก่อกำเนิดประกายแสงอันใหม่ ดวงดาวทายาทอันมีลักษณะเหมือนผู้ให้กำเนิดของมัน ผู้ท่องผ่านมหาสมุทรอันมืดมิดและปักหลักอยู่ท่ามกลางกลุ่มดาวฤกษ์ สักวัน ทายาทเหล่านี้ก็ต้องถ่ายทอดเปลวไฟ Supernova วัฏจักรอันเปล่งประกายแห่งการเกิดและดับสูญจะวนเวียนต่อไป จนกว่าท้องฟ้าที่เทพ Titan สร้างมาด้วยความเหนื่อยยากไม่อาจจะส่องประกายได้อีกต่อไป \r\n\r\nในเตาหลอมอันเป็นนิรันดร์ ดวงดาราอมตะนั้นได้ถูกเรียกขานว่า Phoenix สลายตัวลงเพื่อก่อเกิดความมีอยู่ และถูกผลักดันเข้าสู่ห้วงอวกาศอันไร้จุดสิ้นสุด เพื่อตามหาที่ของตนท่ามกลางหมู่ดาวพี่น้องเช่นเดียวกับบรรพบุรุษ ความอยากรู้อยากเห็นได้เข้าครอบงำลูกนกตัวน้อย ว่าดวงดาวชราดวงใดกำลังดับสูญอยู่ในความมืด รวมทั้งเรื่องวัฏจักรอันยาวนานที่มันเฝ้าตั้งคำถามและเรียนรู้ สิ่งนั้นได้ทราบว่าท่ามกลางโลกมากมาย ทั้งที่ยังสมบูรณ์และพังทลาย กำลังจะเข้ามาแสดงเอกลักษณ์อันโดดเด่นของตนในสงครามสำคัญระดับจักรวาลที่ดำเนินมาอย่างยาวนาน สิ่งหนึ่งที่กำลังจะค้นพบว่าตนมีค่ามากกว่าเพียงแค่แสงซึ่งส่องจากดวงอาทิตย์ที่กำลังดับลง ด้วยเหตุนี้ บุตรแห่งดวงอาทิตย์จึงถือกำเนิดขึ้นบนโลก แสวงหาหนทางที่จะสาดส่องความอบอุ่นให้แก่ผู้ที่ต้องการมัน หรือผู้ที่อาจคิดจะควบคุมโชคชะตาของมัน",
    "stats": {
        "hit_points": [
            511,
            1495,
            2578
        ],
        "mana": [
            234,
            562,
            1056
        ],
        "damage": [
            45,
            97,
            154
        ],
        "armor": [
            0,
            2,
            7
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 500,
        "missile_speed": "1100"
    },
    "abilities": [
        {
            "id": "phoenix_icarus_dive",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_icarus_dive_hp2.png?v=5027641",
            "name": "Icarus Dive",
            "desc": "Phoenix บินโฉบแบบวิถีโค้งไปยังทิศทางเป้าหมาย สร้างความเสียหายต่อเนื่อง และลดความเร็วในการเคลื่อนที่ ของยูนิตที่มันบินเข้าไปหา แล้วจะโคจรกลับไปยังตำแหน่งเดิม ของมัน ถ้า Phoenix ใช้ Supernova การบินจะจบลง",
            "mana_cost": "",
            "cooldown": "36",
            "video": "http:\/\/www.youtube.com\/embed\/PUkHORxk8J4?hd=1&rel=0",
            "lore": "แม้จะไม่แปลกประหลาดดังการเดินทางภายในช่องว่างจักรวาล การโผบินภายในบรรยากาศก็ให้ความสำราญที่พิเศษไปอีกแบบ",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "สูญเสียพลังชีวิต",
                    "val": "15%"
                },
                {
                    "name": "ระยะเวลาเผาไหม้",
                    "val": "4"
                },
                {
                    "name": "ความเสียหายต่อวินาที",
                    "val": "10 \/ 30 \/ 50 \/ 70"
                },
                {
                    "name": "เคลื่อนที่ช้าลง",
                    "val": "19% \/ 22% \/ 25% \/ 28%"
                }
            ]
        },
        {
            "id": "phoenix_fire_spirits",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_fire_spirits_hp2.png?v=5027641",
            "name": "Fire Spirits",
            "desc": "สร้างดวงวิญญาณแห่งไฟ 4 ดวงล้อมรอบ Phoenix เป็นวงกลม วิญญาณไฟแต่ละดวงสามารถปล่อยได้อย่างอิสระต่อกันไปยังพื้นที่ เป้าหมาย ทำให้ยูนิตศัตรูได้รับความเสียหายต่อเนื่องและถูกลด ความเร็วในการโจมตีมหาศาล",
            "mana_cost": "80\/90\/100\/110",
            "cooldown": "45\/40\/35\/30",
            "video": "http:\/\/www.youtube.com\/embed\/r1MosnS5858?hd=1&rel=0",
            "lore": "แกนหลอมที่ยุบของ Phoenix บ่อยครั้งจะปลดปล่อยแสงอายุสั้นแต่พลังระเบิดที่ล้นเหลือออกมา",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "สูญเสียพลังชีวิต",
                    "val": "20%"
                },
                {
                    "name": "ระยะเวลาของ SPIRIT",
                    "val": "20"
                },
                {
                    "name": "รัศมี",
                    "val": "175 \/ 175 \/ 175 \/ 175"
                },
                {
                    "name": "ระยะเวลาเผาไหม้",
                    "val": "4"
                },
                {
                    "name": "ลดความเร็วในการโจมตี",
                    "val": "80 \/ 100 \/ 120 \/ 140"
                }
            ]
        },
        {
            "id": "phoenix_sun_ray",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_sun_ray_hp2.png?v=5027641",
            "name": "Sun Ray",
            "desc": "Phoenix ยิงลำแสงไฟโดยใช้พลังงานจากพลังชีวิตของมันเอง ลำแสงสร้างความเสียหายแก่ศัตรูและฟื้นฟูพลังชีวิตเพื่อนร่วมทีม โดยคิดจากจำนวนพื้นฐานบวกกับเปอร์เซ็นต์พลังชีวิตของพวกเขา ค่าเปอร์เซ็นต์จะเพิ่มขึ้นเรื่อย ๆ ตามเวลาที่ยิงลำแสงออกไป",
            "mana_cost": "100",
            "cooldown": "26",
            "video": "http:\/\/www.youtube.com\/embed\/HZAiHWRNCjw?hd=1&rel=0",
            "lore": "ปล่อยผ่านกระแสพลังงานจากภายในร่างกายที่เป็นอะตอมทั้งหมด",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "สูญเสียพลังชีวิตต่อวินาที",
                    "val": "6%"
                },
                {
                    "name": "ความเสียหายต่อวินาทีพื้นฐาน",
                    "val": "14 \/ 20 \/ 26 \/ 32"
                },
                {
                    "name": "ฟื้นฟูต่อวินาทีพื้นฐาน",
                    "val": "7 \/ 10 \/ 13 \/ 16"
                },
                {
                    "name": "ฟื้นฟูสูงสุด",
                    "val": "0.625% \/ 1.25% \/ 1.875% \/ 2.5%"
                },
                {
                    "name": "ระยะเวลา",
                    "val": "6"
                }
            ]
        },
        {
            "id": "phoenix_supernova",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/phoenix_supernova_hp2.png?v=5027641",
            "name": "Supernova",
            "desc": "Phoenix เต็มใจที่จะจบชีวิตตัวเองเพื่อโอกาสในการเกิดใหม่ แปลงร่างกายเป็นดวงอาทิตย์ที่เผาไหม้ศัตรูในพื้นที่ขนาดใหญ่ ดวงอาทิตย์สามารถถูกทำลายได้โดยการโจมตีจากฮีโร่อีกฝ่าย หลังจากระยะเวลา 6 วินาทีดวงอาทิตย์จะระเบิด และทำการสตันศัตรูทั้งหมดที่อยู่รอบ ๆ การระเบิดยังทำให้ Phoenix เกิดใหม่ด้วยการฟื้นฟูพลังชีวิตและมานาทั้งหมด และทำการยกเลิกคูลดาวน์ของทุกสกิล    อัปเกรดได้ด้วย Aghanim's Scepter     ชนิดการลบล้าง: การลบล้างขั้นสูง",
            "mana_cost": "200\/200\/200",
            "cooldown": "110",
            "video": "http:\/\/www.youtube.com\/embed\/DkFkvLCYeCY?hd=1&rel=0",
            "lore": "เบ้าหลอมสุริยะของ Supernova นั้นอาจจะมีวันดับสลายได้ แต่กระไรนั้น จากเปลวเพลิงที่ลุกโชตินั้น สัญญาณไฟดวงใหม่จุติขึ้นเพื่อเดินทางไปอย่างไร้ที่สิ้นสุด",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ฮีโร่ฝ่ายเดียวกัน"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมี",
                    "val": "1300"
                },
                {
                    "name": "ความเสียหายต่อวินาที",
                    "val": "60 \/ 90 \/ 120"
                },
                {
                    "name": "ระยะเวลา",
                    "val": "6"
                },
                {
                    "name": "ระยะร่ายโดย SCEPTER",
                    "val": "500"
                }
            ]
        }
    ]
}
