{
    "id": "rubick",
    "name": "Rubick",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/rubick_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/rubick_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะไกล",
    "roles": [
        "ตัวซัพพอร์ต",
        "ตัวหยุด",
        "ตัวนูค"
    ],
    "primary_attribs": "int",
    "overview": {
        "attribs": {
            "int": {
                "base": 25,
                "gain": 3.1
            },
            "agi": {
                "base": 19,
                "gain": 2.1
            },
            "str": {
                "base": 21,
                "gain": 2
            },
            "dmg": {
                "min": 22,
                "max": 32
            },
            "ms": 290,
            "armor": 1.66
        },
        "abilities": [
            {
                "id": "rubick_telekinesis",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_telekinesis_hp1.png?v=5027641",
                "name": "Telekinesis",
                "desc": "Rubick ใช้พลังเทเลคิเนซิสของเขายกศัตรูให้ลอยอยู่กลาง อากาศสักพักหนึ่งแล้วโยนพวกมันกลับลงสู่พื้น ยูนิตจะตกลงพื้น พร้อมกับแรงมหาศาลที่สตันศัตรูที่อยู่ใกล้เคียง"
            },
            {
                "id": "rubick_fade_bolt",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_fade_bolt_hp1.png?v=5027641",
                "name": "Fade Bolt",
                "desc": "Rubick สร้างกระแสพลังเวทมนตร์ที่เคลื่อนผ่านไปมาระหว่างยูนิตศัตรู สร้างความเสียหายและลดพลังโจมตีของพวกมัน ทุกครั้งที่ชิ่งความเสียหายจะลดลง"
            },
            {
                "id": "rubick_arcane_supremacy",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_arcane_supremacy_hp1.png?v=5027641",
                "name": "Arcane Supremacy",
                "desc": "ความเชี่ยวชาญในด้านศาสตร์ลี้ลับของ Rubick ทำให้เขาสามารถสร้างความเสียหายสกิลได้มากขึ้นและทำให้สกิลนั้นติดอยู่กับศัตรูได้นานขึ้น"
            },
            {
                "id": "rubick_spell_steal",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_spell_steal_hp1.png?v=5027641",
                "name": "Spell Steal",
                "desc": "Rubick ศึกษาส่วนสำคัญเพียงเล็กน้อยของฮีโร่ฝ่ายศัตรูหนึ่งตัว ล่วงรู้ถึงเคล็ดลับของเวทมนตร์ที่ฮีโร่ร่ายเป็นครั้งสุดท้าย Rubick สามารถใช้สกิลนี้เสมือนเป็นของตนเป็นระยะเวลาหลายนาที หรือจนกว่าเขาจะตาย     อัปเกรดได้ด้วย Aghanim's Scepter"
            }
        ]
    },
    "bio": "นักเวททุกคนย่อมสามารถร่ายมนต์ได้หนึ่งถึงสองบท และมีเพียงส่วนหนึ่งที่สามารถเล่าเรียนได้นานพอแล้วกลายเป็นจอมเวท แต่มีเพียงคนที่มีความสามารถเป็นเลิศคนเดียวเท่านั้นที่จะได้รับการขนานนามเป็น Magus ถึงกระนั้นในจอมเวทอื่น ๆ ความเห็นของกลุ่มก็ไม่ได้การันตีมารยาทในการแข่งกัน หลังจากที่เขามีชื่อเสียงในฐานะนักประลองฝีมือและนักปราชญ์แห่งโลกเวทมนตร์ที่ยิ่งใหญ่ Rubick ไม่เคยแสดงให้เห็นว่าเขาก็อาจจะมีความสามารถพอที่จะเป็น Magus ได้ จนกระทั่งเขาถูกลอบสังหารเป็นครั้งที่เจ็ด ในขณะที่เขาโยนผู้ที่อาจจะเป็นนักฆ่าลำดับที่ 12 ทิ้งลงมาจากระเบียงสูงอย่างไม่แยแส เขาเข้าใจแล้วว่าความพยายามอย่างที่สุดของเขาที่ผ่านมานั้นโง่เขลาเพียงใด เมื่อครั้งหนึ่งที่การขัดจังหวะการดีดนิ้วหรือปรบมือจะช่วยให้เขาก้าวหน้าขึ้นอย่างน่าชื่นชม ทั้งหมดนั่นกลายเป็นสิ่งที่สามารถคาดเดาได้ เขาได้สร้างการแข่งขันที่น่ากลัวขึ้นมา ด้วยเหตุนี้ หลังจากที่หน้ากากการศึกของเขาเสร็จสิ้น เขาได้ทำในสิ่งที่จอมเวทที่ต้องการจะเลื่อนระดับควรจะทำ นั่นคือเขาประกาศจุดมุ่งหมายของเขาซึ่งคือการสังหาร Magus ผู้นั้น Rubick ตระหนักได้ในทันทีว่าการคุกคาม Magus เพียงหนึ่งคนก็เหมือนกับคุกคามพวกเขาทั้งหมด และพวกมันก็ทุ่มกำลังมาที่เขาเพื่อจัดการเสีย เวทมนตร์ของปรปักษ์แต่ละคนคือกระแสพลังงานที่ไม่อาจหยุดยั้งได้ และทุกการโจมตีล้วนคำนวณไว้แล้วว่าไม่มีทางรอด แต่ในไม่ช้าบางสิ่งก็ได้เกิดขึ้ง เป็นสิ่งที่เหล่าศัตรูของ Rubick ไม่เคยคาดคิด วิชาของพวกเขาดูเหมือนจะย้อนกลับมาเป็นปฏิปักษ์กับพวกเขาเอง ท่ามกลางความโกลาหลของเวทมนตร์ Rubick ได้หัวเราะเบา ๆ เรียนรู้อย่างละเอียดและจำลองพลังนั้นเพื่อที่จะร่ายมันกลับไปยังแต่ละคน สร้างความสับสนท่ามกลางพวกมัน ผู้รวมกลุ่มกันต่อต้านเขา คำกล่าวหาถึงการทรยศเริ่มกระจายออกไป และในไม่ช้าเหล่าผู้ใช้เวททั้งหลายก็หันมาเป็นปฏิปักษ์กันเองโดยไม่ตระหนักเลยว่าใครเป็นผู้อยู่เบื้องหลังสิ่งที่พวกเขาไม่ได้กระทำ ท้ายที่สุดเมื่อการต่อสู้ใกล้จบลง ทุกคนล้วนถูกเผาไม่ก็ถูกแช่แข็งไว้ เปียกชุ่ม ถูกสับ และแทง หลายคนล้มตายด้วยสิ่งประดิษฐ์ของพันธมิตร Rubick อยู่นอกวง เจ็บปวดแต่สุขใจในสัปดาห์แห่งการเฉลิมฉลอง ไม่มีใครแข็งแกร่งพอที่จะต่อกรเมื่อเขายื่นคำร้องแห่งสวรรค์ไปยัง Hidden Council (สภาลับ) และ Insubstantial Eleven (รักษาการทั้งสิบเอ็ด) ได้ลงมติเป็นเอกฉันท์ให้ขนานคำนำหน้านามของเขาในฐานะ Grand Magus",
    "stats": {
        "hit_points": [
            549,
            1081,
            1841
        ],
        "mana": [
            325,
            889,
            1552
        ],
        "damage": [
            47,
            90,
            141
        ],
        "armor": [
            2,
            6,
            12
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 550,
        "missile_speed": "1125"
    },
    "abilities": [
        {
            "id": "rubick_telekinesis",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_telekinesis_hp2.png?v=5027641",
            "name": "Telekinesis",
            "desc": "Rubick ใช้พลังเทเลคิเนซิสของเขายกศัตรูให้ลอยอยู่กลาง อากาศสักพักหนึ่งแล้วโยนพวกมันกลับลงสู่พื้น ยูนิตจะตกลงพื้น พร้อมกับแรงมหาศาลที่สตันศัตรูที่อยู่ใกล้เคียง",
            "mana_cost": "125",
            "cooldown": "34\/30\/26\/22",
            "video": "http:\/\/www.youtube.com\/embed\/SbfekAl6ZBM?hd=1&rel=0",
            "lore": " แม้แต่ Grandest Magus เอง ยังใช้พลังของตัวเองเพื่อความเพลิดเพลิน",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลายก",
                    "val": "0.8 \/ 1.2 \/ 1.6 \/ 2"
                },
                {
                    "name": "ระยะเวลาสตัน",
                    "val": "1 \/ 1.25 \/ 1.5 \/ 1.75"
                },
                {
                    "name": "รัศมีตกกระทบ",
                    "val": "325 \/ 325 \/ 325 \/ 325"
                },
                {
                    "name": "ระยะร่าย",
                    "val": "550 \/ 575 \/ 600 \/ 625"
                }
            ]
        },
        {
            "id": "rubick_fade_bolt",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_fade_bolt_hp2.png?v=5027641",
            "name": "Fade Bolt",
            "desc": "Rubick สร้างกระแสพลังเวทมนตร์ที่เคลื่อนผ่านไปมาระหว่างยูนิตศัตรู สร้างความเสียหายและลดพลังโจมตีของพวกมัน ทุกครั้งที่ชิ่งความเสียหายจะลดลง",
            "mana_cost": "120\/130\/140\/150",
            "cooldown": "16\/14\/12\/10",
            "video": "http:\/\/www.youtube.com\/embed\/eZ6g4fnlkC8?hd=1&rel=0",
            "lore": "เวทมนตร์โปรดของ Rubick สำหรับจัดการเหล่ามือสังหาร จริงๆแล้วเป็นการร่ายมนต์ที่แสนเรียบง่าย",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ความเสียหาย",
                    "val": "80 \/ 160 \/ 240 \/ 320"
                },
                {
                    "name": "ระยะเวลาดีบัฟ",
                    "val": "10 \/ 10 \/ 10 \/ 10"
                }
            ]
        },
        {
            "id": "rubick_arcane_supremacy",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_arcane_supremacy_hp2.png?v=5027641",
            "name": "Arcane Supremacy",
            "desc": "ความเชี่ยวชาญในด้านศาสตร์ลี้ลับของ Rubick ทำให้เขาสามารถสร้างความเสียหายสกิลได้มากขึ้นและทำให้สกิลนั้นติดอยู่กับศัตรูได้นานขึ้น",
            "mana_cost": "",
            "cooldown": "",
            "lore": "ไม่ใช่ว่า Magus ทุกคนจะเป็น Grand Magus ได้...",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ติดตัว"
                }
            ],
            "damage": [
                {
                    "name": "เพิ่มความเสียหายสกิล",
                    "val": "14% \/ 18% \/ 22% \/ 26%"
                },
                {
                    "name": "เพิ่มระยะเวลาดีบัฟ",
                    "val": "20% \/ 28% \/ 36% \/ 44%"
                }
            ]
        },
        {
            "id": "rubick_spell_steal",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/rubick_spell_steal_hp2.png?v=5027641",
            "name": "Spell Steal",
            "desc": "Rubick ศึกษาส่วนสำคัญเพียงเล็กน้อยของฮีโร่ฝ่ายศัตรูหนึ่งตัว ล่วงรู้ถึงเคล็ดลับของเวทมนตร์ที่ฮีโร่ร่ายเป็นครั้งสุดท้าย Rubick สามารถใช้สกิลนี้เสมือนเป็นของตนเป็นระยะเวลาหลายนาที หรือจนกว่าเขาจะตาย     อัปเกรดได้ด้วย Aghanim's Scepter",
            "mana_cost": "25\/25\/25",
            "cooldown": "20\/18\/16",
            "video": "http:\/\/www.youtube.com\/embed\/RBiGEs77jDQ?hd=1&rel=0",
            "lore": "... แม้จะเป็นเวทมนตร์ที่ไร้ค่าของพวกมัน ก็สามารถเป็นแหล่งพลังของความสามารถที่หลากหลายได้",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ฮีโร่ศัตรู"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลา",
                    "val": "180 \/ 240 \/ 300"
                },
                {
                    "name": "คูลดาวน์โดย SCEPTER",
                    "val": "2"
                }
            ]
        }
    ]
}
