{
    "id": "techies",
    "name": "Techies",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/techies_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/techies_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะไกล",
    "role": [
        "ตัวนูค",
        "ตัวหยุด"
    ],
    "primary_attribs": "int",
    "overview": {
        "attribs": {
            "int": {
                "base": 22,
                "gain": 3.3
            },
            "agi": {
                "base": 14,
                "gain": 1.3
            },
            "str": {
                "base": 19,
                "gain": 2.5
            },
            "dmg": {
                "min": 9,
                "max": 11
            },
            "ms": 310,
            "armor": 6.96
        },
        "abilities": [
            {
                "id": "techies_land_mines",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_land_mines_hp1.png?v=5027641",
                "name": "Proximity Mines",
                "desc": "วางระเบิดล่องหนซึ่งไม่สามารถตรวจพบได้โดย True Sight แต่มองเห็นได้หากศัตรูเข้ามาอยู่ภายในพื้นที่ทำงาน 400 หน่วยของระเบิด ระเบิดจะทำงานเมื่อศัตรูยืนอยู่ภายในพื้นที่ทำงานเป็นเวลา 1.6 วินาที การระเบิดสร้างความเสียหายเต็มจำนวนรัศมีระเบิด และสร้างความเสียหาย 25% ต่อสิ่งก่อสร้าง"
            },
            {
                "id": "techies_stasis_trap",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_stasis_trap_hp1.png?v=5027641",
                "name": "Stasis Trap",
                "desc": "วางกับดักล่องหนที่จะทำให้ยูนิตศัตรูที่อยู่ใกล้เคียงติดรากทันที เมื่อกับดักทำงาน"
            },
            {
                "id": "techies_suicide",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_suicide_hp1.png?v=5027641",
                "name": "Blast Off!",
                "desc": "Techies พุ่งตัวของพวกเขาเข้าไปท่ามกลางศัตรู ชาร์จแล้วพุ่งเข้าไประเบิด สร้างความเสียหายอย่างยิ่งใหญ่ในพื้นที่และใบ้ศัตรู เมื่อลงถึงพื้นที่เป้าหมาย การระเบิดจะสร้างความเสียหายต่อ Techies เท่ากับ 50% ของพลังชีวิตสูงสุดของพวกเขา"
            },
            {
                "id": "techies_remote_mines",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_remote_mines_hp1.png?v=5027641",
                "name": "Remote Mines",
                "desc": "วางระเบิดล่องหนที่จะระเบิดหลังจากดีเลย์สั้น ๆ เมื่อถูกจุดชนวนเท่านั้น ไม่สร้างความเสียหายต่อสิ่งก่อสร้าง    อัปเกรดได้ด้วย Aghanim's Scepter"
            }
        ]
    },
    "bio": "ในเรื่องเล่าของตำนานการผจญภัยแห่งเมืองริมอ่าว Dredger's Bight คงไม่มีเรื่องใดที่น่าอัปยศเกินกว่าหายนะทำลายล้างของเรื่อง Techies Demolitions อีกแล้ว และอีกครั้งที่เป็นเหตุให้ Dredger's Bight ไร้การมีอยู่จากนั้นเป็นต้นมา รวมถึงเมือง Toterin และ Trapper Town ก็เช่นกัน ความจริงแล้วหากมีใครสักคนขุดคุ้ยติดตามความจริงของเรื่องราวของ Techies Demolitions นี้ละก็ พวกเขาคงค้นพบว่าเพียงเวลาสั้น ๆ ที่พบการปรากฏตัวของเจ้าพวก Techies ขึ้นมาที่ใด เมืองแถบนั้นมักจะอันตรธานหายไปเช่นกัน \r\n\r\nราวกับว่าหายนะทุกอย่างที่ไม่อาจหลีกเลี่ยงได้จะรายล้อมอยู่รอบตัวพวก Techies การหายไปของเมือง Dredger's Bight นั้นมีที่มาเริ่มต้นจากการประดิษฐ์บางสิ่ง จากการที่ได้รับมอบหมายงานให้ออกแบบวิธีการจุดระเบิดเหมืองที่อยู่ใต้เมืองให้ปลอดภัยขึ้น สามสหายอัจฉริยะผู้เชี่ยวชาญเพลิง Squee Spleen และ Spoon ได้พัฒนาสร้างสิ่งประดิษฐ์อันแสนพิกลที่สุดของพวกเขา คือปุ่มกดที่เมื่อกดลงไปแล้ว จะจุดชนวนอุปกรณ์จากระยะไกลได้ \r\n\r\n \r\n\r\nด้วยความกระตือรือร้นที่อยากทดสอบสิ่งประดิษฐ์ของพวกเขาเต็มแก่ สามเกลอแข็งขันกันเติมผงดินระเบิดลงในถังแล้วถังเล่า ในห้องทดลองเล็ก ๆ ของพวกเขาเต็มไปด้วยระเบิดควบคุมระยะไกลที่เพิ่งพัฒนาใหม่ของพวกเขาสุมเป็นกองอยู่ทั่วทุกมุมห้อง พวกเขาลากระเบิดทั้งหมดออกไปในทีเดียวจากในคลังอาวุธของพวกเขา แล้วนำไปฝังไว้ในที่ไกล ๆ ในขณะที่พวกเขาต่างหมอบหลบอยู่ในหลุม Spleen ก็กดปุ่มจุดชนวน แต่ก็ไม่มีอะไรเกิดขึ้นในเวลานั้น ด้วยความฉงนใจ เขาจึงยืนขึ้นแล้วกดปุ่มย้ำอีกครั้งและอีกครั้งจนกระทั่ง เกิดระเบิดรุนแรงจนฉีกกระชากเป็นหลุมในสนาม หลังจากนั้น Squee และ Spleen เจอแรงมหาศาลของคลื่นเสียงกระแทกพวกเขาปลิวจนลอยกลับมาถึงบ้าน \r\n\r\n \r\n\r\nด้วยความงุนงง หูของพวกเขายังคงอื้อก้องไปหมดจากแรงระเบิดที่คาดไม่ถึง พวกเขาสองคนรวมตัวกันในหมอกไอพิษสกปรกและพบว่าควันโขมงลอยอยู่เหนือที่ที่เคยเป็นที่ตั้งห้องทดลองของพวกเขา เศษไม้และหินยังคงค่อย ๆ ร่วงกราวลงในขณะที่หลุมจากแรงระเบิดที่อยู่ตรงหน้าพวกเขาค่อย ๆ ขยายลึกลงไปอย่างช้า ๆ จนเป็นหลุมกว้างขึ้นมา เมือง Dredger's Bight ทั้งเมืองสั่นไหว และค่อย ๆ เลื่อนไหลจมลงไปในเหมืองที่อยู่ข้างใต้ โดยที่ชาวเมืองต่างก็หนีตายอย่างโกลาหล \r\n\r\n \r\n\r\nขณะที่กำลังนั่งกันอยู่ที่ขอบหลุมตรงที่ที่บ้านของพวกเขาจมลงไป พวกเขายิ้มเยาะและหัวเราะคิกคักกัน ที่สะเพร่าเลินเล่อในความเป็นไปได้ เมื่อพวกเขาไม่ได้ตระหนักถึงเสียงก่นด่าของเหล่าเพื่อนบ้านของพวกเขาเลย พวกเขามีเพียงสิ่งเดียวที่สงสัยอยากรู้ว่า พวกเขาจะจุดระเบิดให้รุนแรงยิ่งกว่านี้ได้ยังไงนะ?",
    "stats": {
        "hit_points": [
            511,
            1176,
            2031
        ],
        "mana": [
            286,
            887,
            1576
        ],
        "damage": [
            31,
            77,
            130
        ],
        "armor": [
            7,
            10,
            14
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 700,
        "missile_speed": "900"
    },
    "abilities": [
        {
            "id": "techies_land_mines",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_land_mines_hp2.png?v=5027641",
            "name": "Proximity Mines",
            "desc": "วางระเบิดล่องหนซึ่งไม่สามารถตรวจพบได้โดย True Sight แต่มองเห็นได้หากศัตรูเข้ามาอยู่ภายในพื้นที่ทำงาน 400 หน่วยของระเบิด ระเบิดจะทำงานเมื่อศัตรูยืนอยู่ภายในพื้นที่ทำงานเป็นเวลา 1.6 วินาที การระเบิดสร้างความเสียหายเต็มจำนวนรัศมีระเบิด และสร้างความเสียหาย 25% ต่อสิ่งก่อสร้าง",
            "mana_cost": "110\/130\/150\/170",
            "cooldown": "12",
            "video": "http:\/\/www.youtube.com\/embed\/2CE4VAX29Bo?hd=1&rel=0",
            "lore": "ความฉิบหายของเมือง Toterin!",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมี",
                    "val": "400"
                },
                {
                    "name": "ความเสียหาย",
                    "val": "200 \/ 400 \/ 600 \/ 800"
                },
                {
                    "name": "ความเสียหายต่อสิ่งก่อสร้าง",
                    "val": "25%"
                },
                {
                    "name": "ดีเลย์การเริ่มทำงาน",
                    "val": "1.75"
                }
            ]
        },
        {
            "id": "techies_stasis_trap",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_stasis_trap_hp2.png?v=5027641",
            "name": "Stasis Trap",
            "desc": "วางกับดักล่องหนที่จะทำให้ยูนิตศัตรูที่อยู่ใกล้เคียงติดรากทันที เมื่อกับดักทำงาน",
            "mana_cost": "80\/110\/140\/160",
            "cooldown": "20\/16\/13\/10",
            "video": "http:\/\/www.youtube.com\/embed\/mkoWUQ2JTQA?hd=1&rel=0",
            "lore": "ตัวหายนะแห่งเมือง Trapper Town!",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมีที่ทำงาน",
                    "val": "400"
                },
                {
                    "name": "รัศมีติดราก",
                    "val": "600"
                },
                {
                    "name": "ระยะเวลาติดราก",
                    "val": "2 \/ 3 \/ 4 \/ 5"
                },
                {
                    "name": "เวลาในการล่องหนของกับดัก",
                    "val": "2"
                }
            ]
        },
        {
            "id": "techies_suicide",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_suicide_hp2.png?v=5027641",
            "name": "Blast Off!",
            "desc": "Techies พุ่งตัวของพวกเขาเข้าไปท่ามกลางศัตรู ชาร์จแล้วพุ่งเข้าไประเบิด สร้างความเสียหายอย่างยิ่งใหญ่ในพื้นที่และใบ้ศัตรู เมื่อลงถึงพื้นที่เป้าหมาย การระเบิดจะสร้างความเสียหายต่อ Techies เท่ากับ 50% ของพลังชีวิตสูงสุดของพวกเขา",
            "mana_cost": "100\/125\/150\/175",
            "cooldown": "35",
            "video": "http:\/\/www.youtube.com\/embed\/yieLNvs_GPc?hd=1&rel=0",
            "lore": "นี่เราจะไปไหนหรอ?",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ศัตรู"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมี",
                    "val": "400"
                },
                {
                    "name": "ระยะเวลาใบ้",
                    "val": "4 \/ 5 \/ 6 \/ 7"
                },
                {
                    "name": "ความเสียหายต่อตนเองจากพลังชีวิตสูงสุด",
                    "val": "50%"
                }
            ]
        },
        {
            "id": "techies_remote_mines",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/techies_remote_mines_hp2.png?v=5027641",
            "name": "Remote Mines",
            "desc": "วางระเบิดล่องหนที่จะระเบิดหลังจากดีเลย์สั้น ๆ เมื่อถูกจุดชนวนเท่านั้น ไม่สร้างความเสียหายต่อสิ่งก่อสร้าง    อัปเกรดได้ด้วย Aghanim's Scepter",
            "mana_cost": "120\/180\/240",
            "cooldown": "8",
            "video": "http:\/\/www.youtube.com\/embed\/MtWbyUgaAZA?hd=1&rel=0",
            "lore": "การล่มสลายของเมือง Dredger's Bight!",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ตำแหน่งเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ความเสียหาย",
                    "val": "300 \/ 450 \/ 600"
                },
                {
                    "name": "รัศมีการระเบิด",
                    "val": "425"
                },
                {
                    "name": "ระยะเวลากับระเบิด",
                    "val": "600"
                },
                {
                    "name": "ดีเลย์การล่องหน",
                    "val": "2"
                },
                {
                    "name": "ระยะร่าย",
                    "val": "500"
                },
                {
                    "name": "ความเสียหายโดย SCEPTER",
                    "val": "450 \/ 600 \/ 750"
                },
                {
                    "name": "ระยะร่ายโดย SCEPTER",
                    "val": "700"
                }
            ]
        }
    ]
}