{
    "id": "winter_wyvern",
    "name": "Winter Wyvern",
    "portrait": {
        "full": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/winter_wyvern_full.png?v=5027641?v=5027641",
        "vert": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/heroes\/winter_wyvern_vert.jpg?v=5027641"
    },
    "attack": "โจมตีระยะไกล",
    "roles": [
        "ตัวซัพพอร์ต",
        "ตัวหยุด",
        "ตัวนูค"
    ],
    "primary_attribs": "int",
    "overview": {
        "attribs": {
            "int": {
                "base": 26,
                "gain": 3.6
            },
            "agi": {
                "base": 16,
                "gain": 1.9
            },
            "str": {
                "base": 26,
                "gain": 2.6
            },
            "dmg": {
                "min": 12,
                "max": 19
            },
            "ms": 285,
            "armor": 1.24
        },
        "abilities": [
            {
                "id": "winter_wyvern_arctic_burn",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_arctic_burn_hp1.png?v=5027641",
                "name": "Arctic Burn",
                "desc": "Winter Wyvern โผบินขึ้นเหนือลมหนาว ทำให้เธอเคลื่อนที่ได้อย่างอิสระ และสามารถพ่นลมหายใจอันหนาวเหน็บออกไปในแต่ละการโจมตี ขณะโผบิน เธอจะโจมตีได้ไกลขึ้น ยิงออกไปได้เร็วขึ้น และทำให้ศัตรูเคลื่อนที่ช้าลงและได้รับความเสียหายเวทมนตร์ 6% ของพลังชีวิตต่อวินาทีจากพลังชีวิตที่เหลืออยู่ การมองเห็นของเธอจะเฉียบคมยิ่งขึ้นในตอนกลางคืน ทำให้เธอได้รับระยะการมองเห็นตอนกลางคืนเพิ่มขึ้น 400 หน่วยขณะบิน    อัปเกรดได้ด้วย Aghanim's Scepter"
            },
            {
                "id": "winter_wyvern_splinter_blast",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_splinter_blast_hp1.png?v=5027641",
                "name": "Splinter Blast",
                "desc": "ยิงกระสุนน้ำแข็งอันเปราะบางไปยังศัตรูเป้าหมาย กระสุนจะ แตกกระจายออกเมื่อกระทบเป้าหมาย ทำให้เป้าหมายหลักไม่ได้ รับผลใด ๆ โดยกระสุนที่แตกออกจะชิ่งไปหายูนิตที่อยู่ใกล้เคียง ในรัศมี 500 หน่วย กระสุนที่ชิ่งดังกล่าวจะสร้างความเสียหาย แก่ศัตรูและทำให้ศัตรูเคลื่อนที่ช้าลง 30%"
            },
            {
                "id": "winter_wyvern_cold_embrace",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_cold_embrace_hp1.png?v=5027641",
                "name": "Cold Embrace",
                "desc": "ห่อหุ้มเพื่อนร่วมทีมเข้าไว้ในรังไหมน้ำแข็ง ทำให้ยูนิตดังกล่าว แข็งอยู่กับที่และได้รับการฟื้นฟูพลังชีวิตในแต่ละวินาทีตาม ค่าเริ่มต้นรวมกับค่าเปอร์เซ็นต์จากพลังชีวิตสูงสุดของเป้าหมาย รังไหมจะป้องกันความเสียหายทางกายภาพที่ได้รับทั้งหมด"
            },
            {
                "id": "winter_wyvern_winters_curse",
                "icon": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_winters_curse_hp1.png?v=5027641",
                "name": "Winter's Curse",
                "desc": "Winter Wyvern แช่แข็งศัตรูให้อยู่กับที่และสาปยูนิตศัตรูที่ อยู่ใกล้เคียงให้ได้รับคำสาปคลั่ง ทำให้พวกเขาหันมาโจมตีเพื่อน ร่วมทีมของพวกเขาที่ถูกแช่แข็งอยู่ด้วยความเร็วในการโจมตีที่ เพิ่มขึ้น ยูนิตที่ถูกแช่แข็งหรือถูกสาปให้โจมตีฝ่ายเดียวกันจะไม่ได้ รับความเสียหายทั้งหมดจากศัตรูของพวกเขา"
            }
        ]
    },
    "bio": "Auroth ก็เป็นดั่งเช่นนักกวีเอกที่ยิ่งใหญ่ทั้งหลาย ที่เพียงแต่ต้องการเวลาในการประพันธ์บทกวี หากแต่ชีวิตของการเป็นมังกร Winter Wyvern นั้นเต็มไปด้วยการถูกขัดจังหวะเวลา บทมหากาพย์ของมังกรโบราณนั้นมีเรื่องราวประวัติศาสตร์ที่ยาวนานและมีสีสัน แต่ก็มีบางคนที่เกรงว่าเหล่ามังกรปราชญ์ที่เหลืออยู่จะไม่มีมากมายเหมือนเมื่อสมัยก่อนแล้ว มีเพียงบรรทัดเพียงไม่กี่บรรทัดที่ถูกเขียนเพิ่มในบทกวีมังกร Eldwurm Edda ตั้งแต่ยุครุ่งเรืองครั้งล่าสุด Auroth คร่ำครวญอาลัยไว้ว่า \"เราต่างหลงลืม ว่าชีวิตมีค่ากว่าชัยชนะ หรืออำนาจเหนือศัตรูใด และเรายังจำต้องดำเนินชีวิตของพวกเรา ในการไล่ตามหาความเป็นศิลปินในตัวเรา\" นางได้เริ่มดำเนินการคณะสำรวจเพื่อค้นคว้า รวบรวมหนังสือมากมายเพื่อหาแรงบันดาลใจ แต่ว่าการค้นคว้าทั้งหมดนี้มักถูกกวนใจอยู่บ่อยครั้ง และนางก็ใช้เวลาในการประพันธ์น้อยเกินกว่าที่ควรจะเป็น แม้ว่านางจะทราบดีว่านางควรหลบซุ่มแต่ในถ้ำของนาง เขียนเพิ่มเติมในบทกวี นางกลับต้องหลวมตัวเข้าไปในการต่อสู้มหากาพย์กับศัตรูที่แข็งแกร่งทั้งหลาย นางได้บุกปล้นชิงปราสาท ฝ่าเข้าหอสมุดโบราณมากมาย... และแม้ว่านางจะกองสุมชัยชนะและความรุ่งโรจน์ของตนไว้ นางจะเกล่าบอกตนเองว่ามันเป็นเพียงผลกระทบจากการค้นคว้าของนางเท่านั้น ในความเป็นจริงก็คือทักษะและพลังของนางในสนามรบจะเป็นที่กล่าวถึงระดับตำนาน งานวิชาที่แสนตรากตรำของนางป่านนี้คงเป็นที่น่าสรรเสริญในวรรณกรรมไปแล้ว แต่นางก็ยังไม่พร้อมที่จะยอมรับเป็นตัวเอกชูโรงในนิยายตำนานวีรกรรม นางยังปราถนาที่จะเป็นผู้สร้างมันอีกด้วย",
    "stats": {
        "hit_points": [
            644,
            1336,
            2210
        ],
        "mana": [
            338,
            993,
            1721
        ],
        "damage": [
            38,
            88,
            144
        ],
        "armor": [
            1,
            5,
            10
        ],
        "sight_range": [
            1800,
            800
        ],
        "attack_range": 425,
        "missile_speed": "700"
    },
    "abilities": [
        {
            "id": "winter_wyvern_arctic_burn",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_arctic_burn_hp2.png?v=5027641",
            "name": "Arctic Burn",
            "desc": "Winter Wyvern โผบินขึ้นเหนือลมหนาว ทำให้เธอเคลื่อนที่ได้อย่างอิสระ และสามารถพ่นลมหายใจอันหนาวเหน็บออกไปในแต่ละการโจมตี ขณะโผบิน เธอจะโจมตีได้ไกลขึ้น ยิงออกไปได้เร็วขึ้น และทำให้ศัตรูเคลื่อนที่ช้าลงและได้รับความเสียหายเวทมนตร์ 6% ของพลังชีวิตต่อวินาทีจากพลังชีวิตที่เหลืออยู่ การมองเห็นของเธอจะเฉียบคมยิ่งขึ้นในตอนกลางคืน ทำให้เธอได้รับระยะการมองเห็นตอนกลางคืนเพิ่มขึ้น 400 หน่วยขณะบิน    อัปเกรดได้ด้วย Aghanim's Scepter",
            "mana_cost": "90",
            "cooldown": "50\/40\/30\/20",
            "video": "http:\/\/www.youtube.com\/embed\/QJjASKaV5pM?hd=1&rel=0",
            "lore": "มังกรแต่ละตัวต่างก็มีเปลวพลิงอันร้อนแรงอยู่ในร่างกาย แต่ในตัวของ Auroth นางมีความเย็นที่มิอาจจินตนาการได้ การหายใจจากภายในร่างกายของนางจะทำให้ศัตรูทุกข์ทรมานดั่งการถูกเผาไหม้",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ไม่มีเป้าหมาย"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลาบิน",
                    "val": "8"
                },
                {
                    "name": "เพิ่มระยะการโจมตี",
                    "val": "350 \/ 425 \/ 500 \/ 575"
                },
                {
                    "name": "เผาผลาญพลังชีวิต",
                    "val": "6% \/ 7% \/ 8% \/ 9%"
                },
                {
                    "name": "ระยะเวลาเผาไหม้",
                    "val": "5"
                },
                {
                    "name": "เพิ่มระยะการมองเห็นตอนกลางคืน",
                    "val": "400"
                },
                {
                    "name": "มานาต่อวินาทีโดย SCEPTER",
                    "val": "40"
                }
            ]
        },
        {
            "id": "winter_wyvern_splinter_blast",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_splinter_blast_hp2.png?v=5027641",
            "name": "Splinter Blast",
            "desc": "ยิงกระสุนน้ำแข็งอันเปราะบางไปยังศัตรูเป้าหมาย กระสุนจะ แตกกระจายออกเมื่อกระทบเป้าหมาย ทำให้เป้าหมายหลักไม่ได้ รับผลใด ๆ โดยกระสุนที่แตกออกจะชิ่งไปหายูนิตที่อยู่ใกล้เคียง ในรัศมี 500 หน่วย กระสุนที่ชิ่งดังกล่าวจะสร้างความเสียหาย แก่ศัตรูและทำให้ศัตรูเคลื่อนที่ช้าลง 30%",
            "mana_cost": "105\/120\/135\/150",
            "cooldown": "7",
            "video": "http:\/\/www.youtube.com\/embed\/SCGete8RbbU?hd=1&rel=0",
            "lore": "ถูกผลิตขึ้นอย่างช้า ๆ ในร่างกายอันเยือกเย็นของนาง ซึ่ง Winter Wyvern ใช้เพื่อพ่นสะเก็ดน้ำแข็งใส่ศัตรูของนาง",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ประเภทความเสียหาย",
                    "val": "เวทมนตร์"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ไม่ได้"
                }
            ],
            "damage": [
                {
                    "name": "พลังโจมตี",
                    "val": "100 \/ 180 \/ 260 \/ 340"
                },
                {
                    "name": "รัศมีการแตก",
                    "val": "500"
                },
                {
                    "name": "เคลื่อนที่ช้าลง",
                    "val": "30%"
                },
                {
                    "name": "ระยะเวลาที่ช้าลง",
                    "val": "4"
                }
            ]
        },
        {
            "id": "winter_wyvern_cold_embrace",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_cold_embrace_hp2.png?v=5027641",
            "name": "Cold Embrace",
            "desc": "ห่อหุ้มเพื่อนร่วมทีมเข้าไว้ในรังไหมน้ำแข็ง ทำให้ยูนิตดังกล่าว แข็งอยู่กับที่และได้รับการฟื้นฟูพลังชีวิตในแต่ละวินาทีตาม ค่าเริ่มต้นรวมกับค่าเปอร์เซ็นต์จากพลังชีวิตสูงสุดของเป้าหมาย รังไหมจะป้องกันความเสียหายทางกายภาพที่ได้รับทั้งหมด",
            "mana_cost": "50\/60\/70\/80",
            "cooldown": "24\/21\/18\/15",
            "video": "http:\/\/www.youtube.com\/embed\/8UDmKdYAQP4?hd=1&rel=0",
            "lore": "หัวใจแห่งลมหนาวมาพร้อมกับโอบกอดเยียวยาอันเยือกเย็น ความเย็นทำให้เลือดหมุนเวียนช้าลงและทำให้มนตราทำการรักษาได้ดียิ่งขึ้น",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายเดียวกัน"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "ระยะเวลา",
                    "val": "4"
                },
                {
                    "name": "ค่าฟื้นฟูพลังชีวิตเริ่มต้น",
                    "val": "14 \/ 18 \/ 22 \/ 26"
                },
                {
                    "name": "เปอร์เซ็นต์ฟื้นฟูจากพลังชีวิตสูงสุด",
                    "val": "3% \/ 4% \/ 5% \/ 6%"
                }
            ]
        },
        {
            "id": "winter_wyvern_winters_curse",
            "img": "http:\/\/cdn.dota2.com\/apps\/dota2\/images\/abilities\/winter_wyvern_winters_curse_hp2.png?v=5027641",
            "name": "Winter's Curse",
            "desc": "Winter Wyvern แช่แข็งศัตรูให้อยู่กับที่และสาปยูนิตศัตรูที่ อยู่ใกล้เคียงให้ได้รับคำสาปคลั่ง ทำให้พวกเขาหันมาโจมตีเพื่อน ร่วมทีมของพวกเขาที่ถูกแช่แข็งอยู่ด้วยความเร็วในการโจมตีที่ เพิ่มขึ้น ยูนิตที่ถูกแช่แข็งหรือถูกสาปให้โจมตีฝ่ายเดียวกันจะไม่ได้ รับความเสียหายทั้งหมดจากศัตรูของพวกเขา",
            "mana_cost": "250",
            "cooldown": "80",
            "video": "http:\/\/www.youtube.com\/embed\/AW7PdQw92ak?hd=1&rel=0",
            "lore": "คาถาที่เก่าแก่ที่สุดของมังกรหนังสือ คำสาปนี้บอกความจริงจากสิ่งที่เห็น บางครั้งศัตรูของศัตรูข้าก็ยังเป็นศัตรูของข้า",
            "affects": [
                {
                    "name": "ประเภทสกิล",
                    "val": "ยูนิตเป้าหมาย"
                },
                {
                    "name": "ส่งผลต่อ",
                    "val": "ยูนิตฝ่ายศัตรู"
                },
                {
                    "name": "ทะลุผ่านการป้องกันเวทโดยสมบูรณ์",
                    "val": "ได้"
                }
            ],
            "damage": [
                {
                    "name": "รัศมีการสาป",
                    "val": "500"
                },
                {
                    "name": "ลดความเสียหายจากการสาป",
                    "val": "100%"
                },
                {
                    "name": "ความเร็วในการโจมตีจากการสาป",
                    "val": "55"
                }
            ]
        }
    ]
}
